Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x1961 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x26213): GNU C11 9.3.1 20200408 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x33495): ../Core/Src/Modbus.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x4a32): D:/Facu/Facultad/Tesis/codes/Main code/Placa-de-control-PIP/stm32_PIP/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_name        : int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 7	(unsigned)
    <33>   DW_AT_name        : (indirect string, offset: 0xc091): unsigned int
 <1><37>: Abbrev Number: 3 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x42650): long long int
 <1><3e>: Abbrev Number: 3 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 8

 <2><207>: Abbrev Number: 11 (DW_TAG_enumerator)
    <208>   DW_AT_name        : (indirect string, offset: 0x8f162): osPriorityAboveNormal3
    <20c>   DW_AT_const_value : 35
 <2><20d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <20e>   DW_AT_name        : (indirect string, offset: 0x8f179): osPriorityAboveNormal4
    <212>   DW_AT_const_value : 36
 <2><213>: Abbrev Number: 11 (DW_TAG_enumerator)
    <214>   DW_AT_name        : (indirect string, offset: 0x87659): osPriorityAboveNormal5
    <218>   DW_AT_const_value : 37
 <2><219>: Abbrev Number: 11 (DW_TAG_enumerator)
    <21a>   DW_AT_name        : (indirect string, offset: 0x8f1a6): osPriorityAboveNormal6
    <21e>   DW_AT_const_value : 38
 <2><21f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <220>   DW_AT_name        : (indirect string, offset: 0x8f1bd): osPriorityAboveNormal7
    <224>   DW_AT_const_value : 39
 <2><225>: Abbrev Number: 11 (DW_TAG_enumerator)
    <226>   DW_AT_name        : (indirect string, offset: 0x1bb47): osPriorityHigh
    <22a>   DW_AT_const_value : 40
 <2><22b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <22c>   DW_AT_name        : (indirect string, offset: 0x5fc40): osPriorityHigh1
    <230>   DW_AT_const_value : 41
 <2><231>: Abbrev Number: 11 (DW_TAG_enumerator)
    <232>   DW_AT_name        : (indirect string, offset: 0x5fc50): osPriorityHigh2
    <236>   DW_AT_const_value : 42
 <2><237>: Abbrev Number: 11 (DW_TAG_enumerator)
    <238>   DW_AT_name        : (indirect string, offset: 0x5fc60): osPriorityHigh3
    <23c>   DW_AT_const_value : 43
 <2><23d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <23e>   DW_AT_name        : (indirect string, offset: 0x5fc70): osPriorityHigh4
    <242>   DW_AT_const_value : 44
 <2><243>: Abbrev Number: 11 (DW_TAG_enumerator)
    <244>   DW_AT_name        : (indirect string, offset: 0x301e): osPriorityHigh5
    <248>   DW_AT_const_value : 45
 <2><249>: Abbrev Number: 11 (DW_TAG_enumerator)
    <24a>   DW_AT_name        : (indirect string, offset: 0x5fcac): osPriorityHigh6
    <24e>   DW_AT_const_value : 46
 <2><24f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <250>   DW_AT_name        : (indirect string, offset: 0x5fcbc): osPriorityHigh7
    <254>   DW_AT_const_value : 47
 <2><255>: Abbrev Number: 11 (DW_TAG_enumerator)
    <256>   DW_AT_name        : (indirect string, offset: 0x829ac): osPriorityRealtime
    <25a>   DW_AT_const_value : 48
 <2><25b>: Abbrev Number: 11 (DW_TAG_enumerator)
    <25c>   DW_AT_name        : (indirect string, offset: 0x5a89e): osPriorityRealtime1
    <260>   DW_AT_const_value : 49
 <2><261>: Abbrev Number: 11 (DW_TAG_enumerator)
    <262>   DW_AT_name        : (indirect string, offset: 0x5a8b2): osPriorityRealtime2
    <266>   DW_AT_const_value : 50
 <2><267>: Abbrev Number: 11 (DW_TAG_enumerator)
    <268>   DW_AT_name        : (indirect string, offset: 0x5a8c6): osPriorityRealtime3
    <26c>   DW_AT_const_value : 51
 <2><26d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <26e>   DW_AT_name        : (indirect string, offset: 0x5a8da): osPriorityRealtime4
    <272>   DW_AT_const_value : 52
 <2><273>: Abbrev Number: 11 (DW_TAG_enumerator)
    <274>   DW_AT_name        : (indirect string, offset: 0x5a8ee): osPriorityRealtime5
    <278>   DW_AT_const_value : 53
 <2><279>: Abbrev Number: 11 (DW_TAG_enumerator)
    <27a>   DW_AT_name        : (indirect string, offset: 0x5a902): osPriorityRealtime6
    <27e>   DW_AT_const_value : 54
 <2><27f>: Abbrev Number: 11 (DW_TAG_enumerator)
    <280>   DW_AT_name        : (indirect string, offset: 0x5a916): osPriorityRealtime7
    <284>   DW_AT_const_value : 55
 <2><285>: Abbrev Number: 11 (DW_TAG_enumerator)
    <286>   DW_AT_name        : (indirect string, offset: 0x50807): osPriorityISR
    <28a>   DW_AT_const_value : 56
 <2><28b>: Abbrev Number: 12 (DW_TAG_enumerator)
    <28c>   DW_AT_name        : (indirect string, offset: 0x7f2a1): osPriorityError
    <290>   DW_AT_const_value : -1
 <2><291>: Abbrev Number: 13 (DW_TAG_enumerator)
    <292>   DW_AT_name        : (indirect string, offset: 0x7c41e): osPriorityReserved
    <296>   DW_AT_const_value : 0x7fffffff
 <2><29a>: Abbrev Number: 0
 <1><29b>: Abbrev Number: 4 (DW_TAG_typedef)
    <29c>   DW_AT_name        : (indirect string, offset: 0x20ea3): osPriority_t
    <2a0>   DW_AT_decl_file   : 5
    <2a1>   DW_AT_decl_line   : 136
    <2a2>   DW_AT_decl_column : 3
    <2a3>   DW_AT_type        : <0x14b>
 <1><2a7>: Abbrev Number: 4 (DW_TAG_typedef)
    <2a8>   DW_AT_name        : (indirect string, offset: 0x33cab): osThreadId_t
    <2ac>   DW_AT_decl_file   : 5
    <2ad>   DW_AT_decl_line   : 189
    <2ae>   DW_AT_decl_column : 15
    <2af>   DW_AT_type        : <0x12b>
 <1><2b3>: Abbrev Number: 4 (DW_TAG_typedef)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x6f444): osSemaphoreId_t
    <2b8>   DW_AT_decl_file   : 5
    <2b9>   DW_AT_decl_line   : 201
    <2ba>   DW_AT_decl_column : 15
    <2bb>   DW_AT_type        : <0x12b>
 <1><2bf>: Abbrev Number: 4 (DW_TAG_typedef)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x41a8e): osMessageQueueId_t
    <2c4>   DW_AT_decl_file   : 5
    <2c5>   DW_AT_decl_line   : 207
    <2c6>   DW_AT_decl_column : 15
    <2c7>   DW_AT_type        : <0x12b>
 <1><2cb>: Abbrev Number: 4 (DW_TAG_typedef)
    <2cc>   DW_AT_name        : (indirect string, offset: 0x61212): TZ_ModuleId_t
    <2d0>   DW_AT_decl_file   : 5
    <2d1>   DW_AT_decl_line   : 213
    <2d2>   DW_AT_decl_column : 18
    <2d3>   DW_AT_type        : <0x10e>
 <1><2d7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <2d8>   DW_AT_byte_size   : 36
    <2d9>   DW_AT_decl_file   : 5
    <2da>   DW_AT_decl_line   : 218
    <2db>   DW_AT_decl_column : 9
    <2dc>   DW_AT_sibling     : <0x356>
 <2><2e0>: Abbrev Number: 15 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x6057c): name
    <2e5>   DW_AT_decl_file   : 5
    <2e6>   DW_AT_decl_line   : 219
    <2e7>   DW_AT_decl_column : 33
    <2e8>   DW_AT_type        : <0x356>
    <2ec>   DW_AT_data_member_location: 0
 <2><2ed>: Abbrev Number: 15 (DW_TAG_member)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x5e47a): attr_bits
    <2f2>   DW_AT_decl_file   : 5
    <2f3>   DW_AT_decl_line   : 220
    <2f4>   DW_AT_decl_column : 28
    <2f5>   DW_AT_type        : <0x10e>
    <2f9>   DW_AT_data_member_location: 4
 <2><2fa>: Abbrev Number: 15 (DW_TAG_member)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x1bf00): cb_mem
    <2ff>   DW_AT_decl_file   : 5
    <300>   DW_AT_decl_line   : 221
    <301>   DW_AT_decl_column : 30
    <302>   DW_AT_type        : <0x12b>
    <306>   DW_AT_data_member_location: 8
 <2><307>: Abbrev Number: 15 (DW_TAG_member)
    <308>   DW_AT_name        : (indirect string, offset: 0x101f5): cb_size
    <30c>   DW_AT_decl_file   : 5
    <30d>   DW_AT_decl_line   : 222
    <30e>   DW_AT_decl_column : 30
    <30f>   DW_AT_type        : <0x10e>
    <313>   DW_AT_data_member_location: 12
 <2><314>: Abbrev Number: 15 (DW_TAG_member)
    <315>   DW_AT_name        : (indirect string, offset: 0x82f28): stack_mem
    <319>   DW_AT_decl_file   : 5
    <31a>   DW_AT_decl_line   : 223
    <31b>   DW_AT_decl_column : 27
    <31c>   DW_AT_type        : <0x12b>
    <320>   DW_AT_data_member_location: 16
 <2><321>: Abbrev Number: 15 (DW_TAG_member)
    <322>   DW_AT_name        : (indirect string, offset: 0x5a93c): stack_size
    <326>   DW_AT_decl_file   : 5
    <327>   DW_AT_decl_line   : 224
    <328>   DW_AT_decl_column : 27
    <329>   DW_AT_type        : <0x10e>
    <32d>   DW_AT_data_member_location: 20
 <2><32e>: Abbrev Number: 15 (DW_TAG_member)
    <32f>   DW_AT_name        : (indirect string, offset: 0x398fb): priority
    <333>   DW_AT_decl_file   : 5
    <334>   DW_AT_decl_line   : 225
    <335>   DW_AT_decl_column : 29
    <336>   DW_AT_type        : <0x29b>
    <33a>   DW_AT_data_member_location: 24
 <2><33b>: Abbrev Number: 15 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0x3e471): tz_module
    <340>   DW_AT_decl_file   : 5
    <341>   DW_AT_decl_line   : 226
    <342>   DW_AT_decl_column : 28
    <343>   DW_AT_type        : <0x2cb>
    <347>   DW_AT_data_member_location: 28
 <2><348>: Abbrev Number: 15 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0x81971): reserved
    <34d>   DW_AT_decl_file   : 5
    <34e>   DW_AT_decl_line   : 227
    <34f>   DW_AT_decl_column : 29
    <350>   DW_AT_type        : <0x10e>
    <354>   DW_AT_data_member_location: 32
 <2><355>: Abbrev Number: 0
 <1><356>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <357>   DW_AT_byte_size   : 4
    <358>   DW_AT_type        : <0x363>
 <1><35c>: Abbrev Number: 3 (DW_TAG_base_type)
    <35d>   DW_AT_byte_size   : 1
    <35e>   DW_AT_encoding    : 8	(unsigned char)
    <35f>   DW_AT_name        : (indirect string, offset: 0x2ede6): char
 <1><363>: Abbrev Number: 5 (DW_TAG_const_type)
    <364>   DW_AT_type        : <0x35c>
 <1><368>: Abbrev Number: 4 (DW_TAG_typedef)
    <369>   DW_AT_name        : (indirect string, offset: 0x2e8b0): osThreadAttr_t
    <36d>   DW_AT_decl_file   : 5
    <36e>   DW_AT_decl_line   : 228
    <36f>   DW_AT_decl_column : 3
    <370>   DW_AT_type        : <0x2d7>
 <1><374>: Abbrev Number: 5 (DW_TAG_const_type)
    <375>   DW_AT_type        : <0x368>
 <1><379>: Abbrev Number: 14 (DW_TAG_structure_type)
    <37a>   DW_AT_byte_size   : 16
    <37b>   DW_AT_decl_file   : 5
    <37c>   DW_AT_decl_line   : 255
    <37d>   DW_AT_decl_column : 9
    <37e>   DW_AT_sibling     : <0x3bb>
 <2><382>: Abbrev Number: 16 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0x6057c): name
    <387>   DW_AT_decl_file   : 5
    <388>   DW_AT_decl_line   : 256
    <38a>   DW_AT_decl_column : 33
    <38b>   DW_AT_type        : <0x356>
    <38f>   DW_AT_data_member_location: 0
 <2><390>: Abbrev Number: 16 (DW_TAG_member)
    <391>   DW_AT_name        : (indirect string, offset: 0x5e47a): attr_bits
    <395>   DW_AT_decl_file   : 5
    <396>   DW_AT_decl_line   : 257
    <398>   DW_AT_decl_column : 28
    <399>   DW_AT_type        : <0x10e>
    <39d>   DW_AT_data_member_location: 4
 <2><39e>: Abbrev Number: 16 (DW_TAG_member)
    <39f>   DW_AT_name        : (indirect string, offset: 0x1bf00): cb_mem
    <3a3>   DW_AT_decl_file   : 5
    <3a4>   DW_AT_decl_line   : 258
    <3a6>   DW_AT_decl_column : 30
    <3a7>   DW_AT_type        : <0x12b>
    <3ab>   DW_AT_data_member_location: 8
 <2><3ac>: Abbrev Number: 16 (DW_TAG_member)
    <3ad>   DW_AT_name        : (indirect string, offset: 0x101f5): cb_size
    <3b1>   DW_AT_decl_file   : 5
    <3b2>   DW_AT_decl_line   : 259
    <3b4>   DW_AT_decl_column : 30
    <3b5>   DW_AT_type        : <0x10e>
    <3b9>   DW_AT_data_member_location: 12
 <2><3ba>: Abbrev Number: 0
 <1><3bb>: Abbrev Number: 17 (DW_TAG_typedef)
    <3bc>   DW_AT_name        : (indirect string, offset: 0x31fdc): osSemaphoreAttr_t
    <3c0>   DW_AT_decl_file   : 5
    <3c1>   DW_AT_decl_line   : 260
    <3c3>   DW_AT_decl_column : 3
    <3c4>   DW_AT_type        : <0x379>
 <1><3c8>: Abbrev Number: 5 (DW_TAG_const_type)
    <3c9>   DW_AT_type        : <0x3bb>
 <1><3cd>: Abbrev Number: 18 (DW_TAG_structure_type)
    <3ce>   DW_AT_byte_size   : 24
    <3cf>   DW_AT_decl_file   : 5
    <3d0>   DW_AT_decl_line   : 273
    <3d2>   DW_AT_decl_column : 9
    <3d3>   DW_AT_sibling     : <0x42c>
 <2><3d7>: Abbrev Number: 16 (DW_TAG_member)
    <3d8>   DW_AT_name        : (indirect string, offset: 0x6057c): name
    <3dc>   DW_AT_decl_file   : 5
    <3dd>   DW_AT_decl_line   : 274
    <3df>   DW_AT_decl_column : 33
    <3e0>   DW_AT_type        : <0x356>
    <3e4>   DW_AT_data_member_location: 0
 <2><3e5>: Abbrev Number: 16 (DW_TAG_member)
    <3e6>   DW_AT_name        : (indirect string, offset: 0x5e47a): attr_bits
    <3ea>   DW_AT_decl_file   : 5
    <3eb>   DW_AT_decl_line   : 275
    <3ed>   DW_AT_decl_column : 28
    <3ee>   DW_AT_type        : <0x10e>
    <3f2>   DW_AT_data_member_location: 4
 <2><3f3>: Abbrev Number: 16 (DW_TAG_member)
    <3f4>   DW_AT_name        : (indirect string, offset: 0x1bf00): cb_mem
    <3f8>   DW_AT_decl_file   : 5
    <3f9>   DW_AT_decl_line   : 276
    <3fb>   DW_AT_decl_column : 30
    <3fc>   DW_AT_type        : <0x12b>
    <400>   DW_AT_data_member_location: 8
 <2><401>: Abbrev Number: 16 (DW_TAG_member)
    <402>   DW_AT_name        : (indirect string, offset: 0x101f5): cb_size
    <406>   DW_AT_decl_file   : 5
    <407>   DW_AT_decl_line   : 277
    <409>   DW_AT_decl_column : 30
    <40a>   DW_AT_type        : <0x10e>
    <40e>   DW_AT_data_member_location: 12
 <2><40f>: Abbrev Number: 16 (DW_TAG_member)
    <410>   DW_AT_name        : (indirect string, offset: 0x393b5): mq_mem
    <414>   DW_AT_decl_file   : 5
    <415>   DW_AT_decl_line   : 278
    <417>   DW_AT_decl_column : 30
    <418>   DW_AT_type        : <0x12b>
    <41c>   DW_AT_data_member_location: 16
 <2><41d>: Abbrev Number: 16 (DW_TAG_member)
    <41e>   DW_AT_name        : (indirect string, offset: 0x80bd5): mq_size
    <422>   DW_AT_decl_file   : 5
    <423>   DW_AT_decl_line   : 279
    <425>   DW_AT_decl_column : 30
    <426>   DW_AT_type        : <0x10e>
    <42a>   DW_AT_data_member_location: 20
 <2><42b>: Abbrev Number: 0
 <1><42c>: Abbrev Number: 17 (DW_TAG_typedef)
    <42d>   DW_AT_name        : (indirect string, offset: 0x426a3): osMessageQueueAttr_t
    <431>   DW_AT_decl_file   : 5
    <432>   DW_AT_decl_line   : 280
    <434>   DW_AT_decl_column : 3
    <435>   DW_AT_type        : <0x3cd>
 <1><439>: Abbrev Number: 5 (DW_TAG_const_type)
    <43a>   DW_AT_type        : <0x42c>
 <1><43e>: Abbrev Number: 4 (DW_TAG_typedef)
    <43f>   DW_AT_name        : (indirect string, offset: 0x7d632): TaskHandle_t
    <443>   DW_AT_decl_file   : 6
    <444>   DW_AT_decl_line   : 61
    <445>   DW_AT_decl_column : 16
    <446>   DW_AT_type        : <0x12b>
 <1><44a>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <44b>   DW_AT_encoding    : 7	(unsigned)
    <44c>   DW_AT_byte_size   : 1
    <44d>   DW_AT_type        : <0x64>
    <451>   DW_AT_decl_file   : 6
    <452>   DW_AT_decl_line   : 82
    <453>   DW_AT_decl_column : 1
    <454>   DW_AT_sibling     : <0x477>
 <2><458>: Abbrev Number: 11 (DW_TAG_enumerator)
    <459>   DW_AT_name        : (indirect string, offset: 0x3c802): eNoAction
    <45d>   DW_AT_const_value : 0
 <2><45e>: Abbrev Number: 11 (DW_TAG_enumerator)
    <45f>   DW_AT_name        : (indirect string, offset: 0x642c7): eSetBits
    <463>   DW_AT_const_value : 1
 <2><464>: Abbrev Number: 11 (DW_TAG_enumerator)
    <465>   DW_AT_name        : (indirect string, offset: 0x9a4b1): eIncrement
    <469>   DW_AT_const_value : 2
 <2><46a>: Abbrev Number: 11 (DW_TAG_enumerator)
    <46b>   DW_AT_name        : (indirect string, offset: 0x66991): eSetValueWithOverwrite
    <46f>   DW_AT_const_value : 3
 <2><470>: Abbrev Number: 11 (DW_TAG_enumerator)
    <471>   DW_AT_name        : (indirect string, offset: 0x2902d): eSetValueWithoutOverwrite
    <475>   DW_AT_const_value : 4
 <2><476>: Abbrev Number: 0
 <1><477>: Abbrev Number: 4 (DW_TAG_typedef)
    <478>   DW_AT_name        : (indirect string, offset: 0x34142): QueueHandle_t
    <47c>   DW_AT_decl_file   : 7
    <47d>   DW_AT_decl_line   : 46
    <47e>   DW_AT_decl_column : 16
    <47f>   DW_AT_type        : <0x12b>
 <1><483>: Abbrev Number: 19 (DW_TAG_variable)
    <484>   DW_AT_name        : (indirect string, offset: 0x34d1): ITM_RxBuffer
    <488>   DW_AT_decl_file   : 9
    <489>   DW_AT_decl_line   : 1864
    <48b>   DW_AT_decl_column : 25
    <48c>   DW_AT_type        : <0x109>
    <490>   DW_AT_external    : 1
    <490>   DW_AT_declaration : 1
 <1><490>: Abbrev Number: 20 (DW_TAG_array_type)
    <491>   DW_AT_type        : <0xdb>
    <495>   DW_AT_sibling     : <0x4a0>
 <2><499>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <49a>   DW_AT_type        : <0x30>
    <49e>   DW_AT_upper_bound : 15
 <2><49f>: Abbrev Number: 0
 <1><4a0>: Abbrev Number: 5 (DW_TAG_const_type)
    <4a1>   DW_AT_type        : <0x490>
 <1><4a5>: Abbrev Number: 7 (DW_TAG_variable)
    <4a6>   DW_AT_name        : (indirect string, offset: 0x82aa9): AHBPrescTable
    <4aa>   DW_AT_decl_file   : 10
    <4ab>   DW_AT_decl_line   : 52
    <4ac>   DW_AT_decl_column : 23
    <4ad>   DW_AT_type        : <0x4a0>
    <4b1>   DW_AT_external    : 1
    <4b1>   DW_AT_declaration : 1
 <1><4b1>: Abbrev Number: 20 (DW_TAG_array_type)
    <4b2>   DW_AT_type        : <0xdb>
    <4b6>   DW_AT_sibling     : <0x4c1>
 <2><4ba>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <4bb>   DW_AT_type        : <0x30>
    <4bf>   DW_AT_upper_bound : 7
 <2><4c0>: Abbrev Number: 0
 <1><4c1>: Abbrev Number: 5 (DW_TAG_const_type)
    <4c2>   DW_AT_type        : <0x4b1>
 <1><4c6>: Abbrev Number: 7 (DW_TAG_variable)
    <4c7>   DW_AT_name        : (indirect string, offset: 0x5c9ed): APBPrescTable
    <4cb>   DW_AT_decl_file   : 10
    <4cc>   DW_AT_decl_line   : 53
    <4cd>   DW_AT_decl_column : 23
    <4ce>   DW_AT_type        : <0x4c1>
    <4d2>   DW_AT_external    : 1
    <4d2>   DW_AT_declaration : 1
 <1><4d2>: Abbrev Number: 18 (DW_TAG_structure_type)
    <4d3>   DW_AT_byte_size   : 16
    <4d4>   DW_AT_decl_file   : 11
    <4d5>   DW_AT_decl_line   : 291
    <4d7>   DW_AT_decl_column : 9
    <4d8>   DW_AT_sibling     : <0x515>
 <2><4dc>: Abbrev Number: 22 (DW_TAG_member)
    <4dd>   DW_AT_name        : CCR
    <4e1>   DW_AT_decl_file   : 11
    <4e2>   DW_AT_decl_line   : 293
    <4e4>   DW_AT_decl_column : 17
    <4e5>   DW_AT_type        : <0x11a>
    <4e9>   DW_AT_data_member_location: 0
 <2><4ea>: Abbrev Number: 16 (DW_TAG_member)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x382ca): CNDTR
    <4ef>   DW_AT_decl_file   : 11
    <4f0>   DW_AT_decl_line   : 294
    <4f2>   DW_AT_decl_column : 17
    <4f3>   DW_AT_type        : <0x11a>
    <4f7>   DW_AT_data_member_location: 4
 <2><4f8>: Abbrev Number: 16 (DW_TAG_member)
    <4f9>   DW_AT_name        : (indirect string, offset: 0x8a8bd): CPAR
    <4fd>   DW_AT_decl_file   : 11
    <4fe>   DW_AT_decl_line   : 295
    <500>   DW_AT_decl_column : 17
    <501>   DW_AT_type        : <0x11a>
    <505>   DW_AT_data_member_location: 8
 <2><506>: Abbrev Number: 16 (DW_TAG_member)
    <507>   DW_AT_name        : (indirect string, offset: 0x4fe21): CMAR
    <50b>   DW_AT_decl_file   : 11
    <50c>   DW_AT_decl_line   : 296
    <50e>   DW_AT_decl_column : 17
    <50f>   DW_AT_type        : <0x11a>
    <513>   DW_AT_data_member_location: 12
 <2><514>: Abbrev Number: 0
 <1><515>: Abbrev Number: 17 (DW_TAG_typedef)
    <516>   DW_AT_name        : (indirect string, offset: 0x75706): DMA_Channel_TypeDef
    <51a>   DW_AT_decl_file   : 11
    <51b>   DW_AT_decl_line   : 297
    <51d>   DW_AT_decl_column : 3
    <51e>   DW_AT_type        : <0x4d2>
 <1><522>: Abbrev Number: 18 (DW_TAG_structure_type)
    <523>   DW_AT_byte_size   : 8
    <524>   DW_AT_decl_file   : 11
    <525>   DW_AT_decl_line   : 299
    <527>   DW_AT_decl_column : 9
    <528>   DW_AT_sibling     : <0x549>
 <2><52c>: Abbrev Number: 22 (DW_TAG_member)
    <52d>   DW_AT_name        : ISR
    <531>   DW_AT_decl_file   : 11
    <532>   DW_AT_decl_line   : 301
    <534>   DW_AT_decl_column : 17
    <535>   DW_AT_type        : <0x11a>
    <539>   DW_AT_data_member_location: 0
 <2><53a>: Abbrev Number: 16 (DW_TAG_member)
    <53b>   DW_AT_name        : (indirect string, offset: 0x657ab): IFCR
    <53f>   DW_AT_decl_file   : 11
    <540>   DW_AT_decl_line   : 302
    <542>   DW_AT_decl_column : 17
    <543>   DW_AT_type        : <0x11a>
    <547>   DW_AT_data_member_location: 4
 <2><548>: Abbrev Number: 0
 <1><549>: Abbrev Number: 17 (DW_TAG_typedef)
    <54a>   DW_AT_name        : (indirect string, offset: 0x34d23): DMA_TypeDef
    <54e>   DW_AT_decl_file   : 11
    <54f>   DW_AT_decl_line   : 303
    <551>   DW_AT_decl_column : 3
    <552>   DW_AT_type        : <0x522>
 <1><556>: Abbrev Number: 18 (DW_TAG_structure_type)
    <557>   DW_AT_byte_size   : 28
    <558>   DW_AT_decl_file   : 11
    <559>   DW_AT_decl_line   : 358
    <55b>   DW_AT_decl_column : 9
    <55c>   DW_AT_sibling     : <0x5c3>
 <2><560>: Abbrev Number: 22 (DW_TAG_member)
    <561>   DW_AT_name        : CRL
    <565>   DW_AT_decl_file   : 11
    <566>   DW_AT_decl_line   : 360
    <568>   DW_AT_decl_column : 17
    <569>   DW_AT_type        : <0x11a>
    <56d>   DW_AT_data_member_location: 0
 <2><56e>: Abbrev Number: 22 (DW_TAG_member)
    <56f>   DW_AT_name        : CRH
    <573>   DW_AT_decl_file   : 11
    <574>   DW_AT_decl_line   : 361
    <576>   DW_AT_decl_column : 17
    <577>   DW_AT_type        : <0x11a>
    <57b>   DW_AT_data_member_location: 4
 <2><57c>: Abbrev Number: 22 (DW_TAG_member)
    <57d>   DW_AT_name        : IDR
    <581>   DW_AT_decl_file   : 11
    <582>   DW_AT_decl_line   : 362
    <584>   DW_AT_decl_column : 17
    <585>   DW_AT_type        : <0x11a>
    <589>   DW_AT_data_member_location: 8
 <2><58a>: Abbrev Number: 22 (DW_TAG_member)
    <58b>   DW_AT_name        : ODR
    <58f>   DW_AT_decl_file   : 11
    <590>   DW_AT_decl_line   : 363
    <592>   DW_AT_decl_column : 17
    <593>   DW_AT_type        : <0x11a>
    <597>   DW_AT_data_member_location: 12
 <2><598>: Abbrev Number: 16 (DW_TAG_member)
    <599>   DW_AT_name        : (indirect string, offset: 0x2075e): BSRR
    <59d>   DW_AT_decl_file   : 11
    <59e>   DW_AT_decl_line   : 364
    <5a0>   DW_AT_decl_column : 17
    <5a1>   DW_AT_type        : <0x11a>
    <5a5>   DW_AT_data_member_location: 16
 <2><5a6>: Abbrev Number: 22 (DW_TAG_member)
    <5a7>   DW_AT_name        : BRR
    <5ab>   DW_AT_decl_file   : 11
    <5ac>   DW_AT_decl_line   : 365
    <5ae>   DW_AT_decl_column : 17
    <5af>   DW_AT_type        : <0x11a>
    <5b3>   DW_AT_data_member_location: 20
 <2><5b4>: Abbrev Number: 16 (DW_TAG_member)
    <5b5>   DW_AT_name        : (indirect string, offset: 0x7bc3f): LCKR
    <5b9>   DW_AT_decl_file   : 11
    <5ba>   DW_AT_decl_line   : 366
    <5bc>   DW_AT_decl_column : 17
    <5bd>   DW_AT_type        : <0x11a>
    <5c1>   DW_AT_data_member_location: 24
 <2><5c2>: Abbrev Number: 0
 <1><5c3>: Abbrev Number: 17 (DW_TAG_typedef)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x8b3d1): GPIO_TypeDef
    <5c8>   DW_AT_decl_file   : 11
    <5c9>   DW_AT_decl_line   : 367
    <5cb>   DW_AT_decl_column : 3
    <5cc>   DW_AT_type        : <0x556>
 <1><5d0>: Abbrev Number: 18 (DW_TAG_structure_type)
    <5d1>   DW_AT_byte_size   : 28
    <5d2>   DW_AT_decl_file   : 11
    <5d3>   DW_AT_decl_line   : 507
    <5d5>   DW_AT_decl_column : 9
    <5d6>   DW_AT_sibling     : <0x63b>
 <2><5da>: Abbrev Number: 22 (DW_TAG_member)
    <5db>   DW_AT_name        : SR
    <5de>   DW_AT_decl_file   : 11
    <5df>   DW_AT_decl_line   : 509
    <5e1>   DW_AT_decl_column : 17
    <5e2>   DW_AT_type        : <0x11a>
    <5e6>   DW_AT_data_member_location: 0
 <2><5e7>: Abbrev Number: 22 (DW_TAG_member)
    <5e8>   DW_AT_name        : DR
    <5eb>   DW_AT_decl_file   : 11
    <5ec>   DW_AT_decl_line   : 510
    <5ee>   DW_AT_decl_column : 17
    <5ef>   DW_AT_type        : <0x11a>
    <5f3>   DW_AT_data_member_location: 4
 <2><5f4>: Abbrev Number: 22 (DW_TAG_member)
    <5f5>   DW_AT_name        : BRR
    <5f9>   DW_AT_decl_file   : 11
    <5fa>   DW_AT_decl_line   : 511
    <5fc>   DW_AT_decl_column : 17
    <5fd>   DW_AT_type        : <0x11a>
    <601>   DW_AT_data_member_location: 8
 <2><602>: Abbrev Number: 22 (DW_TAG_member)
    <603>   DW_AT_name        : CR1
    <607>   DW_AT_decl_file   : 11
    <608>   DW_AT_decl_line   : 512
    <60a>   DW_AT_decl_column : 17
    <60b>   DW_AT_type        : <0x11a>
    <60f>   DW_AT_data_member_location: 12
 <2><610>: Abbrev Number: 22 (DW_TAG_member)
    <611>   DW_AT_name        : CR2
    <615>   DW_AT_decl_file   : 11
    <616>   DW_AT_decl_line   : 513
    <618>   DW_AT_decl_column : 17
    <619>   DW_AT_type        : <0x11a>
    <61d>   DW_AT_data_member_location: 16
 <2><61e>: Abbrev Number: 22 (DW_TAG_member)
    <61f>   DW_AT_name        : CR3
    <623>   DW_AT_decl_file   : 11
    <624>   DW_AT_decl_line   : 514
    <626>   DW_AT_decl_column : 17
    <627>   DW_AT_type        : <0x11a>
    <62b>   DW_AT_data_member_location: 20
 <2><62c>: Abbrev Number: 16 (DW_TAG_member)
    <62d>   DW_AT_name        : (indirect string, offset: 0x27f71): GTPR
    <631>   DW_AT_decl_file   : 11
    <632>   DW_AT_decl_line   : 515
    <634>   DW_AT_decl_column : 17
    <635>   DW_AT_type        : <0x11a>
    <639>   DW_AT_data_member_location: 24
 <2><63a>: Abbrev Number: 0
 <1><63b>: Abbrev Number: 17 (DW_TAG_typedef)
    <63c>   DW_AT_name        : (indirect string, offset: 0x8e2b8): USART_TypeDef
    <640>   DW_AT_decl_file   : 11
    <641>   DW_AT_decl_line   : 516
    <643>   DW_AT_decl_column : 3
    <644>   DW_AT_type        : <0x5d0>
 <1><648>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <649>   DW_AT_encoding    : 7	(unsigned)
    <64a>   DW_AT_byte_size   : 1
    <64b>   DW_AT_type        : <0x64>
    <64f>   DW_AT_decl_file   : 12
    <650>   DW_AT_decl_line   : 40
    <651>   DW_AT_decl_column : 1
    <652>   DW_AT_sibling     : <0x66f>
 <2><656>: Abbrev Number: 11 (DW_TAG_enumerator)
    <657>   DW_AT_name        : (indirect string, offset: 0x30f71): HAL_OK
    <65b>   DW_AT_const_value : 0
 <2><65c>: Abbrev Number: 11 (DW_TAG_enumerator)
    <65d>   DW_AT_name        : (indirect string, offset: 0x5a4e0): HAL_ERROR
    <661>   DW_AT_const_value : 1
 <2><662>: Abbrev Number: 11 (DW_TAG_enumerator)
    <663>   DW_AT_name        : (indirect string, offset: 0x1913a): HAL_BUSY
    <667>   DW_AT_const_value : 2
 <2><668>: Abbrev Number: 11 (DW_TAG_enumerator)
    <669>   DW_AT_name        : (indirect string, offset: 0x2a476): HAL_TIMEOUT
    <66d>   DW_AT_const_value : 3
 <2><66e>: Abbrev Number: 0
 <1><66f>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <670>   DW_AT_encoding    : 7	(unsigned)
    <671>   DW_AT_byte_size   : 1
    <672>   DW_AT_type        : <0x64>
    <676>   DW_AT_decl_file   : 12
    <677>   DW_AT_decl_line   : 51
    <678>   DW_AT_decl_column : 1
    <679>   DW_AT_sibling     : <0x68a>
 <2><67d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <67e>   DW_AT_name        : (indirect string, offset: 0x6ae3d): HAL_UNLOCKED
    <682>   DW_AT_const_value : 0
 <2><683>: Abbrev Number: 11 (DW_TAG_enumerator)
    <684>   DW_AT_name        : (indirect string, offset: 0x8f502): HAL_LOCKED
    <688>   DW_AT_const_value : 1
 <2><689>: Abbrev Number: 0
 <1><68a>: Abbrev Number: 4 (DW_TAG_typedef)
    <68b>   DW_AT_name        : (indirect string, offset: 0x52163): HAL_LockTypeDef
    <68f>   DW_AT_decl_file   : 12
    <690>   DW_AT_decl_line   : 54
    <691>   DW_AT_decl_column : 3
    <692>   DW_AT_type        : <0x66f>
 <1><696>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <697>   DW_AT_encoding    : 7	(unsigned)
    <698>   DW_AT_byte_size   : 1
    <699>   DW_AT_type        : <0x64>
    <69d>   DW_AT_decl_file   : 13
    <69e>   DW_AT_decl_line   : 66
    <69f>   DW_AT_decl_column : 1
    <6a0>   DW_AT_sibling     : <0x6b1>
 <2><6a4>: Abbrev Number: 11 (DW_TAG_enumerator)
    <6a5>   DW_AT_name        : (indirect string, offset: 0x1dbf6): GPIO_PIN_RESET
    <6a9>   DW_AT_const_value : 0
 <2><6aa>: Abbrev Number: 11 (DW_TAG_enumerator)
    <6ab>   DW_AT_name        : (indirect string, offset: 0x19403): GPIO_PIN_SET
    <6af>   DW_AT_const_value : 1
 <2><6b0>: Abbrev Number: 0
 <1><6b1>: Abbrev Number: 14 (DW_TAG_structure_type)
    <6b2>   DW_AT_byte_size   : 28
    <6b3>   DW_AT_decl_file   : 14
    <6b4>   DW_AT_decl_line   : 48
    <6b5>   DW_AT_decl_column : 9
    <6b6>   DW_AT_sibling     : <0x716>
 <2><6ba>: Abbrev Number: 15 (DW_TAG_member)
    <6bb>   DW_AT_name        : (indirect string, offset: 0x35b56): Direction
    <6bf>   DW_AT_decl_file   : 14
    <6c0>   DW_AT_decl_line   : 50
    <6c1>   DW_AT_decl_column : 12
    <6c2>   DW_AT_type        : <0x10e>
    <6c6>   DW_AT_data_member_location: 0
 <2><6c7>: Abbrev Number: 15 (DW_TAG_member)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x9ca2): PeriphInc
    <6cc>   DW_AT_decl_file   : 14
    <6cd>   DW_AT_decl_line   : 54
    <6ce>   DW_AT_decl_column : 12
    <6cf>   DW_AT_type        : <0x10e>
    <6d3>   DW_AT_data_member_location: 4
 <2><6d4>: Abbrev Number: 15 (DW_TAG_member)
    <6d5>   DW_AT_name        : (indirect string, offset: 0x16614): MemInc
    <6d9>   DW_AT_decl_file   : 14
    <6da>   DW_AT_decl_line   : 57
    <6db>   DW_AT_decl_column : 12
    <6dc>   DW_AT_type        : <0x10e>
    <6e0>   DW_AT_data_member_location: 8
 <2><6e1>: Abbrev Number: 15 (DW_TAG_member)
    <6e2>   DW_AT_name        : (indirect string, offset: 0x48126): PeriphDataAlignment
    <6e6>   DW_AT_decl_file   : 14
    <6e7>   DW_AT_decl_line   : 60
    <6e8>   DW_AT_decl_column : 12
    <6e9>   DW_AT_type        : <0x10e>
    <6ed>   DW_AT_data_member_location: 12
 <2><6ee>: Abbrev Number: 15 (DW_TAG_member)
    <6ef>   DW_AT_name        : (indirect string, offset: 0x82456): MemDataAlignment
    <6f3>   DW_AT_decl_file   : 14
    <6f4>   DW_AT_decl_line   : 63
    <6f5>   DW_AT_decl_column : 12
    <6f6>   DW_AT_type        : <0x10e>
    <6fa>   DW_AT_data_member_location: 16
 <2><6fb>: Abbrev Number: 15 (DW_TAG_member)
    <6fc>   DW_AT_name        : (indirect string, offset: 0x92104): Mode
    <700>   DW_AT_decl_file   : 14
    <701>   DW_AT_decl_line   : 66
    <702>   DW_AT_decl_column : 12
    <703>   DW_AT_type        : <0x10e>
    <707>   DW_AT_data_member_location: 20
 <2><708>: Abbrev Number: 15 (DW_TAG_member)
    <709>   DW_AT_name        : (indirect string, offset: 0x95c28): Priority
    <70d>   DW_AT_decl_file   : 14
    <70e>   DW_AT_decl_line   : 71
    <70f>   DW_AT_decl_column : 12
    <710>   DW_AT_type        : <0x10e>
    <714>   DW_AT_data_member_location: 24
 <2><715>: Abbrev Number: 0
 <1><716>: Abbrev Number: 4 (DW_TAG_typedef)
    <717>   DW_AT_name        : (indirect string, offset: 0x268d6): DMA_InitTypeDef
    <71b>   DW_AT_decl_file   : 14
    <71c>   DW_AT_decl_line   : 73
    <71d>   DW_AT_decl_column : 3
    <71e>   DW_AT_type        : <0x6b1>
 <1><722>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <723>   DW_AT_encoding    : 7	(unsigned)
    <724>   DW_AT_byte_size   : 1
    <725>   DW_AT_type        : <0x64>
    <729>   DW_AT_decl_file   : 14
    <72a>   DW_AT_decl_line   : 79
    <72b>   DW_AT_decl_column : 1
    <72c>   DW_AT_sibling     : <0x749>
 <2><730>: Abbrev Number: 11 (DW_TAG_enumerator)
    <731>   DW_AT_name        : (indirect string, offset: 0x6bdde): HAL_DMA_STATE_RESET
    <735>   DW_AT_const_value : 0
 <2><736>: Abbrev Number: 11 (DW_TAG_enumerator)
    <737>   DW_AT_name        : (indirect string, offset: 0x27716): HAL_DMA_STATE_READY
    <73b>   DW_AT_const_value : 1
 <2><73c>: Abbrev Number: 11 (DW_TAG_enumerator)
    <73d>   DW_AT_name        : (indirect string, offset: 0x6458c): HAL_DMA_STATE_BUSY
    <741>   DW_AT_const_value : 2
 <2><742>: Abbrev Number: 11 (DW_TAG_enumerator)
    <743>   DW_AT_name        : (indirect string, offset: 0x8d057): HAL_DMA_STATE_TIMEOUT
    <747>   DW_AT_const_value : 3
 <2><748>: Abbrev Number: 0
 <1><749>: Abbrev Number: 4 (DW_TAG_typedef)
    <74a>   DW_AT_name        : (indirect string, offset: 0x4fbab): HAL_DMA_StateTypeDef
    <74e>   DW_AT_decl_file   : 14
    <74f>   DW_AT_decl_line   : 84
    <750>   DW_AT_decl_column : 2
    <751>   DW_AT_type        : <0x722>
 <1><755>: Abbrev Number: 23 (DW_TAG_structure_type)
    <756>   DW_AT_name        : (indirect string, offset: 0x7afb2): __DMA_HandleTypeDef
    <75a>   DW_AT_byte_size   : 68
    <75b>   DW_AT_decl_file   : 14
    <75c>   DW_AT_decl_line   : 111
    <75d>   DW_AT_decl_column : 16
    <75e>   DW_AT_sibling     : <0x7ff>
 <2><762>: Abbrev Number: 15 (DW_TAG_member)
    <763>   DW_AT_name        : (indirect string, offset: 0x38a25): Instance
    <767>   DW_AT_decl_file   : 14
    <768>   DW_AT_decl_line   : 113
    <769>   DW_AT_decl_column : 26
    <76a>   DW_AT_type        : <0x7ff>
    <76e>   DW_AT_data_member_location: 0
 <2><76f>: Abbrev Number: 15 (DW_TAG_member)
    <770>   DW_AT_name        : (indirect string, offset: 0x917e9): Init
    <774>   DW_AT_decl_file   : 14
    <775>   DW_AT_decl_line   : 115
    <776>   DW_AT_decl_column : 25
    <777>   DW_AT_type        : <0x716>
    <77b>   DW_AT_data_member_location: 4
 <2><77c>: Abbrev Number: 15 (DW_TAG_member)
    <77d>   DW_AT_name        : (indirect string, offset: 0x67347): Lock
    <781>   DW_AT_decl_file   : 14
    <782>   DW_AT_decl_line   : 117
    <783>   DW_AT_decl_column : 25
    <784>   DW_AT_type        : <0x68a>
    <788>   DW_AT_data_member_location: 32
 <2><789>: Abbrev Number: 15 (DW_TAG_member)
    <78a>   DW_AT_name        : (indirect string, offset: 0x9357d): State
    <78e>   DW_AT_decl_file   : 14
    <78f>   DW_AT_decl_line   : 119
    <790>   DW_AT_decl_column : 25
    <791>   DW_AT_type        : <0x749>
    <795>   DW_AT_data_member_location: 33
 <2><796>: Abbrev Number: 15 (DW_TAG_member)
    <797>   DW_AT_name        : (indirect string, offset: 0x67ad): Parent
    <79b>   DW_AT_decl_file   : 14
    <79c>   DW_AT_decl_line   : 121
    <79d>   DW_AT_decl_column : 26
    <79e>   DW_AT_type        : <0x12b>
    <7a2>   DW_AT_data_member_location: 36
 <2><7a3>: Abbrev Number: 15 (DW_TAG_member)
    <7a4>   DW_AT_name        : (indirect string, offset: 0x8eb2d): XferCpltCallback
    <7a8>   DW_AT_decl_file   : 14
    <7a9>   DW_AT_decl_line   : 123
    <7aa>   DW_AT_decl_column : 28
    <7ab>   DW_AT_type        : <0x816>
    <7af>   DW_AT_data_member_location: 40
 <2><7b0>: Abbrev Number: 15 (DW_TAG_member)
    <7b1>   DW_AT_name        : (indirect string, offset: 0x7072b): XferHalfCpltCallback
    <7b5>   DW_AT_decl_file   : 14
    <7b6>   DW_AT_decl_line   : 125
    <7b7>   DW_AT_decl_column : 28
    <7b8>   DW_AT_type        : <0x816>
    <7bc>   DW_AT_data_member_location: 44
 <2><7bd>: Abbrev Number: 15 (DW_TAG_member)
    <7be>   DW_AT_name        : (indirect string, offset: 0x14741): XferErrorCallback
    <7c2>   DW_AT_decl_file   : 14
    <7c3>   DW_AT_decl_line   : 127
    <7c4>   DW_AT_decl_column : 28
    <7c5>   DW_AT_type        : <0x816>
    <7c9>   DW_AT_data_member_location: 48
 <2><7ca>: Abbrev Number: 15 (DW_TAG_member)
    <7cb>   DW_AT_name        : (indirect string, offset: 0x862ab): XferAbortCallback
    <7cf>   DW_AT_decl_file   : 14
    <7d0>   DW_AT_decl_line   : 129
    <7d1>   DW_AT_decl_column : 28
    <7d2>   DW_AT_type        : <0x816>
    <7d6>   DW_AT_data_member_location: 52
 <2><7d7>: Abbrev Number: 15 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x8c352): ErrorCode
    <7dc>   DW_AT_decl_file   : 14
    <7dd>   DW_AT_decl_line   : 131
    <7de>   DW_AT_decl_column : 25
    <7df>   DW_AT_type        : <0x11a>
    <7e3>   DW_AT_data_member_location: 56
 <2><7e4>: Abbrev Number: 15 (DW_TAG_member)
    <7e5>   DW_AT_name        : (indirect string, offset: 0x3e34b): DmaBaseAddress
    <7e9>   DW_AT_decl_file   : 14
    <7ea>   DW_AT_decl_line   : 133
    <7eb>   DW_AT_decl_column : 27
    <7ec>   DW_AT_type        : <0x81c>
    <7f0>   DW_AT_data_member_location: 60
 <2><7f1>: Abbrev Number: 15 (DW_TAG_member)
    <7f2>   DW_AT_name        : (indirect string, offset: 0x1dca5): ChannelIndex
    <7f6>   DW_AT_decl_file   : 14
    <7f7>   DW_AT_decl_line   : 135
    <7f8>   DW_AT_decl_column : 26
    <7f9>   DW_AT_type        : <0x10e>
    <7fd>   DW_AT_data_member_location: 64
 <2><7fe>: Abbrev Number: 0
 <1><7ff>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <800>   DW_AT_byte_size   : 4
    <801>   DW_AT_type        : <0x515>
 <1><805>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <806>   DW_AT_prototyped  : 1
    <806>   DW_AT_sibling     : <0x810>
 <2><80a>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <80b>   DW_AT_type        : <0x810>
 <2><80f>: Abbrev Number: 0
 <1><810>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <811>   DW_AT_byte_size   : 4
    <812>   DW_AT_type        : <0x755>
 <1><816>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <817>   DW_AT_byte_size   : 4
    <818>   DW_AT_type        : <0x805>
 <1><81c>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <81d>   DW_AT_byte_size   : 4
    <81e>   DW_AT_type        : <0x549>
 <1><822>: Abbrev Number: 4 (DW_TAG_typedef)
    <823>   DW_AT_name        : (indirect string, offset: 0x7afb4): DMA_HandleTypeDef
    <827>   DW_AT_decl_file   : 14
    <828>   DW_AT_decl_line   : 137
    <829>   DW_AT_decl_column : 3
    <82a>   DW_AT_type        : <0x755>
 <1><82e>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <82f>   DW_AT_byte_size   : 4
    <830>   DW_AT_type        : <0x822>
 <1><834>: Abbrev Number: 14 (DW_TAG_structure_type)
    <835>   DW_AT_byte_size   : 28
    <836>   DW_AT_decl_file   : 15
    <837>   DW_AT_decl_line   : 47
    <838>   DW_AT_decl_column : 9
    <839>   DW_AT_sibling     : <0x899>
 <2><83d>: Abbrev Number: 15 (DW_TAG_member)
    <83e>   DW_AT_name        : (indirect string, offset: 0x839a3): BaudRate
    <842>   DW_AT_decl_file   : 15
    <843>   DW_AT_decl_line   : 49
    <844>   DW_AT_decl_column : 12
    <845>   DW_AT_type        : <0x10e>
    <849>   DW_AT_data_member_location: 0
 <2><84a>: Abbrev Number: 15 (DW_TAG_member)
    <84b>   DW_AT_name        : (indirect string, offset: 0x44cd): WordLength
    <84f>   DW_AT_decl_file   : 15
    <850>   DW_AT_decl_line   : 54
    <851>   DW_AT_decl_column : 12
    <852>   DW_AT_type        : <0x10e>
    <856>   DW_AT_data_member_location: 4
 <2><857>: Abbrev Number: 15 (DW_TAG_member)
    <858>   DW_AT_name        : (indirect string, offset: 0x83c5e): StopBits
    <85c>   DW_AT_decl_file   : 15
    <85d>   DW_AT_decl_line   : 57
    <85e>   DW_AT_decl_column : 12
    <85f>   DW_AT_type        : <0x10e>
    <863>   DW_AT_data_member_location: 8
 <2><864>: Abbrev Number: 15 (DW_TAG_member)
    <865>   DW_AT_name        : (indirect string, offset: 0x34413): Parity
    <869>   DW_AT_decl_file   : 15
    <86a>   DW_AT_decl_line   : 60
    <86b>   DW_AT_decl_column : 12
    <86c>   DW_AT_type        : <0x10e>
    <870>   DW_AT_data_member_location: 12
 <2><871>: Abbrev Number: 15 (DW_TAG_member)
    <872>   DW_AT_name        : (indirect string, offset: 0x92104): Mode
    <876>   DW_AT_decl_file   : 15
    <877>   DW_AT_decl_line   : 67
    <878>   DW_AT_decl_column : 12
    <879>   DW_AT_type        : <0x10e>
    <87d>   DW_AT_data_member_location: 16
 <2><87e>: Abbrev Number: 15 (DW_TAG_member)
    <87f>   DW_AT_name        : (indirect string, offset: 0x10f02): HwFlowCtl
    <883>   DW_AT_decl_file   : 15
    <884>   DW_AT_decl_line   : 70
    <885>   DW_AT_decl_column : 12
    <886>   DW_AT_type        : <0x10e>
    <88a>   DW_AT_data_member_location: 20
 <2><88b>: Abbrev Number: 15 (DW_TAG_member)
    <88c>   DW_AT_name        : (indirect string, offset: 0x794b4): OverSampling
    <890>   DW_AT_decl_file   : 15
    <891>   DW_AT_decl_line   : 73
    <892>   DW_AT_decl_column : 12
    <893>   DW_AT_type        : <0x10e>
    <897>   DW_AT_data_member_location: 24
 <2><898>: Abbrev Number: 0
 <1><899>: Abbrev Number: 4 (DW_TAG_typedef)
    <89a>   DW_AT_name        : (indirect string, offset: 0x28847): UART_InitTypeDef
    <89e>   DW_AT_decl_file   : 15
    <89f>   DW_AT_decl_line   : 76
    <8a0>   DW_AT_decl_column : 3
    <8a1>   DW_AT_type        : <0x834>
 <1><8a5>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <8a6>   DW_AT_encoding    : 7	(unsigned)
    <8a7>   DW_AT_byte_size   : 1
    <8a8>   DW_AT_type        : <0x64>
    <8ac>   DW_AT_decl_file   : 15
    <8ad>   DW_AT_decl_line   : 118
    <8ae>   DW_AT_decl_column : 1
    <8af>   DW_AT_sibling     : <0x8e4>
 <2><8b3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <8b4>   DW_AT_name        : (indirect string, offset: 0x3ddc1): HAL_UART_STATE_RESET
    <8b8>   DW_AT_const_value : 0
 <2><8b9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <8ba>   DW_AT_name        : (indirect string, offset: 0x10aa8): HAL_UART_STATE_READY
    <8be>   DW_AT_const_value : 32
 <2><8bf>: Abbrev Number: 11 (DW_TAG_enumerator)
    <8c0>   DW_AT_name        : (indirect string, offset: 0x7f973): HAL_UART_STATE_BUSY
    <8c4>   DW_AT_const_value : 36
 <2><8c5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x1dfa): HAL_UART_STATE_BUSY_TX
    <8ca>   DW_AT_const_value : 33
 <2><8cb>: Abbrev Number: 11 (DW_TAG_enumerator)
    <8cc>   DW_AT_name        : (indirect string, offset: 0x1227): HAL_UART_STATE_BUSY_RX
    <8d0>   DW_AT_const_value : 34
 <2><8d1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <8d2>   DW_AT_name        : (indirect string, offset: 0x20670): HAL_UART_STATE_BUSY_TX_RX
    <8d6>   DW_AT_const_value : 35
 <2><8d7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <8d8>   DW_AT_name        : (indirect string, offset: 0x465da): HAL_UART_STATE_TIMEOUT
    <8dc>   DW_AT_const_value : 160
 <2><8dd>: Abbrev Number: 11 (DW_TAG_enumerator)
    <8de>   DW_AT_name        : (indirect string, offset: 0x65200): HAL_UART_STATE_ERROR
    <8e2>   DW_AT_const_value : 224
 <2><8e3>: Abbrev Number: 0
 <1><8e4>: Abbrev Number: 4 (DW_TAG_typedef)
    <8e5>   DW_AT_name        : (indirect string, offset: 0x2c7f5): HAL_UART_StateTypeDef
    <8e9>   DW_AT_decl_file   : 15
    <8ea>   DW_AT_decl_line   : 136
    <8eb>   DW_AT_decl_column : 3
    <8ec>   DW_AT_type        : <0x8a5>
 <1><8f0>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <8f1>   DW_AT_type        : <0x8e4>
 <1><8f5>: Abbrev Number: 4 (DW_TAG_typedef)
    <8f6>   DW_AT_name        : (indirect string, offset: 0x3ba4b): HAL_UART_RxTypeTypeDef
    <8fa>   DW_AT_decl_file   : 15
    <8fb>   DW_AT_decl_line   : 145
    <8fc>   DW_AT_decl_column : 18
    <8fd>   DW_AT_type        : <0x10e>
 <1><901>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <902>   DW_AT_type        : <0x8f5>
 <1><906>: Abbrev Number: 23 (DW_TAG_structure_type)
    <907>   DW_AT_name        : (indirect string, offset: 0x53946): __UART_HandleTypeDef
    <90b>   DW_AT_byte_size   : 68
    <90c>   DW_AT_decl_file   : 15
    <90d>   DW_AT_decl_line   : 150
    <90e>   DW_AT_decl_column : 16
    <90f>   DW_AT_sibling     : <0x9d7>
 <2><913>: Abbrev Number: 15 (DW_TAG_member)
    <914>   DW_AT_name        : (indirect string, offset: 0x38a25): Instance
    <918>   DW_AT_decl_file   : 15
    <919>   DW_AT_decl_line   : 152
    <91a>   DW_AT_decl_column : 34
    <91b>   DW_AT_type        : <0x9d7>
    <91f>   DW_AT_data_member_location: 0
 <2><920>: Abbrev Number: 15 (DW_TAG_member)
    <921>   DW_AT_name        : (indirect string, offset: 0x917e9): Init
    <925>   DW_AT_decl_file   : 15
    <926>   DW_AT_decl_line   : 154
    <927>   DW_AT_decl_column : 33
    <928>   DW_AT_type        : <0x899>
    <92c>   DW_AT_data_member_location: 4
 <2><92d>: Abbrev Number: 15 (DW_TAG_member)
    <92e>   DW_AT_name        : (indirect string, offset: 0x45727): pTxBuffPtr
    <932>   DW_AT_decl_file   : 15
    <933>   DW_AT_decl_line   : 156
    <934>   DW_AT_decl_column : 34
    <935>   DW_AT_type        : <0x145>
    <939>   DW_AT_data_member_location: 32
 <2><93a>: Abbrev Number: 15 (DW_TAG_member)
    <93b>   DW_AT_name        : (indirect string, offset: 0x3d8c9): TxXferSize
    <93f>   DW_AT_decl_file   : 15
    <940>   DW_AT_decl_line   : 158
    <941>   DW_AT_decl_column : 33
    <942>   DW_AT_type        : <0xec>
    <946>   DW_AT_data_member_location: 36
 <2><947>: Abbrev Number: 15 (DW_TAG_member)
    <948>   DW_AT_name        : (indirect string, offset: 0x4647c): TxXferCount
    <94c>   DW_AT_decl_file   : 15
    <94d>   DW_AT_decl_line   : 160
    <94e>   DW_AT_decl_column : 33
    <94f>   DW_AT_type        : <0xf8>
    <953>   DW_AT_data_member_location: 38
 <2><954>: Abbrev Number: 15 (DW_TAG_member)
    <955>   DW_AT_name        : (indirect string, offset: 0x858f8): pRxBuffPtr
    <959>   DW_AT_decl_file   : 15
    <95a>   DW_AT_decl_line   : 162
    <95b>   DW_AT_decl_column : 34
    <95c>   DW_AT_type        : <0x145>
    <960>   DW_AT_data_member_location: 40
 <2><961>: Abbrev Number: 15 (DW_TAG_member)
    <962>   DW_AT_name        : (indirect string, offset: 0x44e8a): RxXferSize
    <966>   DW_AT_decl_file   : 15
    <967>   DW_AT_decl_line   : 164
    <968>   DW_AT_decl_column : 33
    <969>   DW_AT_type        : <0xec>
    <96d>   DW_AT_data_member_location: 44
 <2><96e>: Abbrev Number: 15 (DW_TAG_member)
    <96f>   DW_AT_name        : (indirect string, offset: 0x56d4e): RxXferCount
    <973>   DW_AT_decl_file   : 15
    <974>   DW_AT_decl_line   : 166
    <975>   DW_AT_decl_column : 33
    <976>   DW_AT_type        : <0xf8>
    <97a>   DW_AT_data_member_location: 46
 <2><97b>: Abbrev Number: 15 (DW_TAG_member)
    <97c>   DW_AT_name        : (indirect string, offset: 0x78cff): ReceptionType
    <980>   DW_AT_decl_file   : 15
    <981>   DW_AT_decl_line   : 168
    <982>   DW_AT_decl_column : 31
    <983>   DW_AT_type        : <0x901>
    <987>   DW_AT_data_member_location: 48
 <2><988>: Abbrev Number: 15 (DW_TAG_member)
    <989>   DW_AT_name        : (indirect string, offset: 0x8bb50): hdmatx
    <98d>   DW_AT_decl_file   : 15
    <98e>   DW_AT_decl_line   : 170
    <98f>   DW_AT_decl_column : 34
    <990>   DW_AT_type        : <0x82e>
    <994>   DW_AT_data_member_location: 52
 <2><995>: Abbrev Number: 15 (DW_TAG_member)
    <996>   DW_AT_name        : (indirect string, offset: 0x8b167): hdmarx
    <99a>   DW_AT_decl_file   : 15
    <99b>   DW_AT_decl_line   : 172
    <99c>   DW_AT_decl_column : 34
    <99d>   DW_AT_type        : <0x82e>
    <9a1>   DW_AT_data_member_location: 56
 <2><9a2>: Abbrev Number: 15 (DW_TAG_member)
    <9a3>   DW_AT_name        : (indirect string, offset: 0x67347): Lock
    <9a7>   DW_AT_decl_file   : 15
    <9a8>   DW_AT_decl_line   : 174
    <9a9>   DW_AT_decl_column : 33
    <9aa>   DW_AT_type        : <0x68a>
    <9ae>   DW_AT_data_member_location: 60
 <2><9af>: Abbrev Number: 15 (DW_TAG_member)
    <9b0>   DW_AT_name        : (indirect string, offset: 0x3b258): gState
    <9b4>   DW_AT_decl_file   : 15
    <9b5>   DW_AT_decl_line   : 176
    <9b6>   DW_AT_decl_column : 33
    <9b7>   DW_AT_type        : <0x8f0>
    <9bb>   DW_AT_data_member_location: 61
 <2><9bc>: Abbrev Number: 15 (DW_TAG_member)
    <9bd>   DW_AT_name        : (indirect string, offset: 0x81e08): RxState
    <9c1>   DW_AT_decl_file   : 15
    <9c2>   DW_AT_decl_line   : 180
    <9c3>   DW_AT_decl_column : 33
    <9c4>   DW_AT_type        : <0x8f0>
    <9c8>   DW_AT_data_member_location: 62
 <2><9c9>: Abbrev Number: 15 (DW_TAG_member)
    <9ca>   DW_AT_name        : (indirect string, offset: 0x8c352): ErrorCode
    <9ce>   DW_AT_decl_file   : 15
    <9cf>   DW_AT_decl_line   : 183
    <9d0>   DW_AT_decl_column : 33
    <9d1>   DW_AT_type        : <0x11a>
    <9d5>   DW_AT_data_member_location: 64
 <2><9d6>: Abbrev Number: 0
 <1><9d7>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <9d8>   DW_AT_byte_size   : 4
    <9d9>   DW_AT_type        : <0x63b>
 <1><9dd>: Abbrev Number: 4 (DW_TAG_typedef)
    <9de>   DW_AT_name        : (indirect string, offset: 0x53948): UART_HandleTypeDef
    <9e2>   DW_AT_decl_file   : 15
    <9e3>   DW_AT_decl_line   : 201
    <9e4>   DW_AT_decl_column : 3
    <9e5>   DW_AT_type        : <0x906>
 <1><9e9>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <9ea>   DW_AT_encoding    : 7	(unsigned)
    <9eb>   DW_AT_byte_size   : 1
    <9ec>   DW_AT_type        : <0x64>
    <9f0>   DW_AT_decl_file   : 16
    <9f1>   DW_AT_decl_line   : 50
    <9f2>   DW_AT_decl_column : 1
    <9f3>   DW_AT_sibling     : <0xa10>
 <2><9f7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x4a569): HAL_TICK_FREQ_10HZ
    <9fc>   DW_AT_const_value : 100
 <2><9fd>: Abbrev Number: 11 (DW_TAG_enumerator)
    <9fe>   DW_AT_name        : (indirect string, offset: 0x35ae0): HAL_TICK_FREQ_100HZ
    <a02>   DW_AT_const_value : 10
 <2><a03>: Abbrev Number: 11 (DW_TAG_enumerator)
    <a04>   DW_AT_name        : (indirect string, offset: 0x43ac7): HAL_TICK_FREQ_1KHZ
    <a08>   DW_AT_const_value : 1
 <2><a09>: Abbrev Number: 11 (DW_TAG_enumerator)
    <a0a>   DW_AT_name        : (indirect string, offset: 0x343b2): HAL_TICK_FREQ_DEFAULT
    <a0e>   DW_AT_const_value : 1
 <2><a0f>: Abbrev Number: 0
 <1><a10>: Abbrev Number: 4 (DW_TAG_typedef)
    <a11>   DW_AT_name        : (indirect string, offset: 0x71e2b): HAL_TickFreqTypeDef
    <a15>   DW_AT_decl_file   : 16
    <a16>   DW_AT_decl_line   : 55
    <a17>   DW_AT_decl_column : 3
    <a18>   DW_AT_type        : <0x9e9>
 <1><a1c>: Abbrev Number: 7 (DW_TAG_variable)
    <a1d>   DW_AT_name        : (indirect string, offset: 0x6a29e): uwTick
    <a21>   DW_AT_decl_file   : 16
    <a22>   DW_AT_decl_line   : 60
    <a23>   DW_AT_decl_column : 22
    <a24>   DW_AT_type        : <0x11a>
    <a28>   DW_AT_external    : 1
    <a28>   DW_AT_declaration : 1
 <1><a28>: Abbrev Number: 7 (DW_TAG_variable)
    <a29>   DW_AT_name        : (indirect string, offset: 0x5c809): uwTickPrio
    <a2d>   DW_AT_decl_file   : 16
    <a2e>   DW_AT_decl_line   : 61
    <a2f>   DW_AT_decl_column : 17
    <a30>   DW_AT_type        : <0x10e>
    <a34>   DW_AT_external    : 1
    <a34>   DW_AT_declaration : 1
 <1><a34>: Abbrev Number: 7 (DW_TAG_variable)
    <a35>   DW_AT_name        : (indirect string, offset: 0x8264a): uwTickFreq
    <a39>   DW_AT_decl_file   : 16
    <a3a>   DW_AT_decl_line   : 62
    <a3b>   DW_AT_decl_column : 28
    <a3c>   DW_AT_type        : <0xa10>
    <a40>   DW_AT_external    : 1
    <a40>   DW_AT_declaration : 1
 <1><a40>: Abbrev Number: 4 (DW_TAG_typedef)
    <a41>   DW_AT_name        : (indirect string, offset: 0x12c72): TimerHandle_t
    <a45>   DW_AT_decl_file   : 17
    <a46>   DW_AT_decl_line   : 76
    <a47>   DW_AT_decl_column : 16
    <a48>   DW_AT_type        : <0x12b>
 <1><a4c>: Abbrev Number: 4 (DW_TAG_typedef)
    <a4d>   DW_AT_name        : (indirect string, offset: 0x4c343): TimerCallbackFunction_t
    <a51>   DW_AT_decl_file   : 17
    <a52>   DW_AT_decl_line   : 81
    <a53>   DW_AT_decl_column : 16
    <a54>   DW_AT_type        : <0xa58>
 <1><a58>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a59>   DW_AT_byte_size   : 4
    <a5a>   DW_AT_type        : <0xa5e>
 <1><a5e>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <a5f>   DW_AT_prototyped  : 1
    <a5f>   DW_AT_sibling     : <0xa69>
 <2><a63>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <a64>   DW_AT_type        : <0xa40>
 <2><a68>: Abbrev Number: 0
 <1><a69>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <a6a>   DW_AT_encoding    : 7	(unsigned)
    <a6b>   DW_AT_byte_size   : 1
    <a6c>   DW_AT_type        : <0x64>
    <a70>   DW_AT_decl_file   : 18
    <a71>   DW_AT_decl_line   : 23
    <a72>   DW_AT_decl_column : 1
    <a73>   DW_AT_sibling     : <0xa90>
 <2><a77>: Abbrev Number: 11 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0x1277a): USART_HW
    <a7c>   DW_AT_const_value : 1
 <2><a7d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0xfe3b): USB_CDC_HW
    <a82>   DW_AT_const_value : 2
 <2><a83>: Abbrev Number: 11 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0x4d7c5): TCP_HW
    <a88>   DW_AT_const_value : 3
 <2><a89>: Abbrev Number: 11 (DW_TAG_enumerator)
    <a8a>   DW_AT_name        : (indirect string, offset: 0x5199b): USART_HW_DMA
    <a8e>   DW_AT_const_value : 4
 <2><a8f>: Abbrev Number: 0
 <1><a90>: Abbrev Number: 4 (DW_TAG_typedef)
    <a91>   DW_AT_name        : (indirect string, offset: 0x16449): mb_hardware_t
    <a95>   DW_AT_decl_file   : 18
    <a96>   DW_AT_decl_line   : 28
    <a97>   DW_AT_decl_column : 2
    <a98>   DW_AT_type        : <0xa69>
 <1><a9c>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <a9d>   DW_AT_encoding    : 7	(unsigned)
    <a9e>   DW_AT_byte_size   : 1
    <a9f>   DW_AT_type        : <0x64>
    <aa3>   DW_AT_decl_file   : 18
    <aa4>   DW_AT_decl_line   : 32
    <aa5>   DW_AT_decl_column : 1
    <aa6>   DW_AT_sibling     : <0xab7>
 <2><aaa>: Abbrev Number: 11 (DW_TAG_enumerator)
    <aab>   DW_AT_name        : (indirect string, offset: 0xce80): MB_SLAVE
    <aaf>   DW_AT_const_value : 3
 <2><ab0>: Abbrev Number: 11 (DW_TAG_enumerator)
    <ab1>   DW_AT_name        : (indirect string, offset: 0x6219a): MB_MASTER
    <ab5>   DW_AT_const_value : 4
 <2><ab6>: Abbrev Number: 0
 <1><ab7>: Abbrev Number: 4 (DW_TAG_typedef)
    <ab8>   DW_AT_name        : (indirect string, offset: 0xac7): mb_masterslave_t
    <abc>   DW_AT_decl_file   : 18
    <abd>   DW_AT_decl_line   : 35
    <abe>   DW_AT_decl_column : 2
    <abf>   DW_AT_type        : <0xa9c>
 <1><ac3>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <ac4>   DW_AT_name        : (indirect string, offset: 0x2e3cf): MB_FC
    <ac8>   DW_AT_encoding    : 7	(unsigned)
    <ac9>   DW_AT_byte_size   : 1
    <aca>   DW_AT_type        : <0x64>
    <ace>   DW_AT_decl_file   : 18
    <acf>   DW_AT_decl_line   : 48
    <ad0>   DW_AT_decl_column : 14
    <ad1>   DW_AT_sibling     : <0xb06>
 <2><ad5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <ad6>   DW_AT_name        : (indirect string, offset: 0x261cb): MB_FC_READ_COILS
    <ada>   DW_AT_const_value : 1
 <2><adb>: Abbrev Number: 11 (DW_TAG_enumerator)
    <adc>   DW_AT_name        : (indirect string, offset: 0x1bb8d): MB_FC_READ_DISCRETE_INPUT
    <ae0>   DW_AT_const_value : 2
 <2><ae1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x8435b): MB_FC_READ_REGISTERS
    <ae6>   DW_AT_const_value : 3
 <2><ae7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <ae8>   DW_AT_name        : (indirect string, offset: 0x21d6a): MB_FC_READ_INPUT_REGISTER
    <aec>   DW_AT_const_value : 4
 <2><aed>: Abbrev Number: 11 (DW_TAG_enumerator)
    <aee>   DW_AT_name        : (indirect string, offset: 0x82186): MB_FC_WRITE_COIL
    <af2>   DW_AT_const_value : 5
 <2><af3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <af4>   DW_AT_name        : (indirect string, offset: 0x1e): MB_FC_WRITE_REGISTER
    <af8>   DW_AT_const_value : 6
 <2><af9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <afa>   DW_AT_name        : (indirect string, offset: 0x1a8ea): MB_FC_WRITE_MULTIPLE_COILS
    <afe>   DW_AT_const_value : 15
 <2><aff>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b00>   DW_AT_name        : (indirect string, offset: 0x52b34): MB_FC_WRITE_MULTIPLE_REGISTERS
    <b04>   DW_AT_const_value : 16
 <2><b05>: Abbrev Number: 0
 <1><b06>: Abbrev Number: 4 (DW_TAG_typedef)
    <b07>   DW_AT_name        : (indirect string, offset: 0x1de5b): mb_functioncode_t
    <b0b>   DW_AT_decl_file   : 18
    <b0c>   DW_AT_decl_line   : 58
    <b0d>   DW_AT_decl_column : 2
    <b0e>   DW_AT_type        : <0xac3>
 <1><b12>: Abbrev Number: 14 (DW_TAG_structure_type)
    <b13>   DW_AT_byte_size   : 132
    <b14>   DW_AT_decl_file   : 18
    <b15>   DW_AT_decl_line   : 61
    <b16>   DW_AT_decl_column : 9
    <b17>   DW_AT_sibling     : <0xb5d>
 <2><b1b>: Abbrev Number: 15 (DW_TAG_member)
    <b1c>   DW_AT_name        : (indirect string, offset: 0x88489): uxBuffer
    <b20>   DW_AT_decl_file   : 18
    <b21>   DW_AT_decl_line   : 63
    <b22>   DW_AT_decl_column : 9
    <b23>   DW_AT_type        : <0xb5d>
    <b27>   DW_AT_data_member_location: 0
 <2><b28>: Abbrev Number: 15 (DW_TAG_member)
    <b29>   DW_AT_name        : (indirect string, offset: 0x5f73c): u8start
    <b2d>   DW_AT_decl_file   : 18
    <b2e>   DW_AT_decl_line   : 64
    <b2f>   DW_AT_decl_column : 9
    <b30>   DW_AT_type        : <0xcf>
    <b34>   DW_AT_data_member_location: 128
 <2><b35>: Abbrev Number: 15 (DW_TAG_member)
    <b36>   DW_AT_name        : (indirect string, offset: 0x1525b): u8end
    <b3a>   DW_AT_decl_file   : 18
    <b3b>   DW_AT_decl_line   : 65
    <b3c>   DW_AT_decl_column : 9
    <b3d>   DW_AT_type        : <0xcf>
    <b41>   DW_AT_data_member_location: 129
 <2><b42>: Abbrev Number: 15 (DW_TAG_member)
    <b43>   DW_AT_name        : (indirect string, offset: 0x76d06): u8available
    <b47>   DW_AT_decl_file   : 18
    <b48>   DW_AT_decl_line   : 66
    <b49>   DW_AT_decl_column : 9
    <b4a>   DW_AT_type        : <0xcf>
    <b4e>   DW_AT_data_member_location: 130
 <2><b4f>: Abbrev Number: 15 (DW_TAG_member)
    <b50>   DW_AT_name        : (indirect string, offset: 0x34385): overflow
    <b54>   DW_AT_decl_file   : 18
    <b55>   DW_AT_decl_line   : 67
    <b56>   DW_AT_decl_column : 9
    <b57>   DW_AT_type        : <0xb6d>
    <b5b>   DW_AT_data_member_location: 131
 <2><b5c>: Abbrev Number: 0
 <1><b5d>: Abbrev Number: 20 (DW_TAG_array_type)
    <b5e>   DW_AT_type        : <0xcf>
    <b62>   DW_AT_sibling     : <0xb6d>
 <2><b66>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <b67>   DW_AT_type        : <0x30>
    <b6b>   DW_AT_upper_bound : 127
 <2><b6c>: Abbrev Number: 0
 <1><b6d>: Abbrev Number: 3 (DW_TAG_base_type)
    <b6e>   DW_AT_byte_size   : 1
    <b6f>   DW_AT_encoding    : 2	(boolean)
    <b70>   DW_AT_name        : (indirect string, offset: 0x42246): _Bool
 <1><b74>: Abbrev Number: 4 (DW_TAG_typedef)
    <b75>   DW_AT_name        : (indirect string, offset: 0x26b51): modbusRingBuffer_t
    <b79>   DW_AT_decl_file   : 18
    <b7a>   DW_AT_decl_line   : 68
    <b7b>   DW_AT_decl_column : 2
    <b7c>   DW_AT_type        : <0xb12>
 <1><b80>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <b81>   DW_AT_name        : (indirect string, offset: 0x8217e): MESSAGE
    <b85>   DW_AT_encoding    : 7	(unsigned)
    <b86>   DW_AT_byte_size   : 1
    <b87>   DW_AT_type        : <0x64>
    <b8b>   DW_AT_decl_file   : 18
    <b8c>   DW_AT_decl_line   : 78
    <b8d>   DW_AT_decl_column : 14
    <b8e>   DW_AT_sibling     : <0xbbc>
 <2><b92>: Abbrev Number: 27 (DW_TAG_enumerator)
    <b93>   DW_AT_name        : ID
    <b96>   DW_AT_const_value : 0
 <2><b97>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b98>   DW_AT_name        : (indirect string, offset: 0x20b3b): FUNC
    <b9c>   DW_AT_const_value : 1
 <2><b9d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b9e>   DW_AT_name        : (indirect string, offset: 0x69cba): ADD_HI
    <ba2>   DW_AT_const_value : 2
 <2><ba3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x6adb8): ADD_LO
    <ba8>   DW_AT_const_value : 3
 <2><ba9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <baa>   DW_AT_name        : (indirect string, offset: 0x5d0f7): NB_HI
    <bae>   DW_AT_const_value : 4
 <2><baf>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x5e3d7): NB_LO
    <bb4>   DW_AT_const_value : 5
 <2><bb5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bb6>   DW_AT_name        : (indirect string, offset: 0x3483d): BYTE_CNT
    <bba>   DW_AT_const_value : 6
 <2><bbb>: Abbrev Number: 0
 <1><bbc>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <bbd>   DW_AT_name        : (indirect string, offset: 0x4c5b2): COM_STATES
    <bc1>   DW_AT_encoding    : 7	(unsigned)
    <bc2>   DW_AT_byte_size   : 1
    <bc3>   DW_AT_type        : <0x64>
    <bc7>   DW_AT_decl_file   : 18
    <bc8>   DW_AT_decl_line   : 89
    <bc9>   DW_AT_decl_column : 14
    <bca>   DW_AT_sibling     : <0xbdb>
 <2><bce>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bcf>   DW_AT_name        : (indirect string, offset: 0x8ff8): COM_IDLE
    <bd3>   DW_AT_const_value : 0
 <2><bd4>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x70791): COM_WAITING
    <bd9>   DW_AT_const_value : 1
 <2><bda>: Abbrev Number: 0
 <1><bdb>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <bdc>   DW_AT_name        : (indirect string, offset: 0x13a8e): ERR_LIST
    <be0>   DW_AT_encoding    : 5	(signed)
    <be1>   DW_AT_byte_size   : 1
    <be2>   DW_AT_type        : <0x51>
    <be6>   DW_AT_decl_file   : 18
    <be7>   DW_AT_decl_line   : 96
    <be8>   DW_AT_decl_column : 14
    <be9>   DW_AT_sibling     : <0xc24>
 <2><bed>: Abbrev Number: 12 (DW_TAG_enumerator)
    <bee>   DW_AT_name        : (indirect string, offset: 0x40b41): ERR_NOT_MASTER
    <bf2>   DW_AT_const_value : -1
 <2><bf3>: Abbrev Number: 12 (DW_TAG_enumerator)
    <bf4>   DW_AT_name        : (indirect string, offset: 0x2cdd5): ERR_POLLING
    <bf8>   DW_AT_const_value : -2
 <2><bf9>: Abbrev Number: 12 (DW_TAG_enumerator)
    <bfa>   DW_AT_name        : (indirect string, offset: 0x57f92): ERR_BUFF_OVERFLOW
    <bfe>   DW_AT_const_value : -3
 <2><bff>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c00>   DW_AT_name        : (indirect string, offset: 0x3d658): ERR_BAD_CRC
    <c04>   DW_AT_const_value : -4
 <2><c05>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c06>   DW_AT_name        : (indirect string, offset: 0x61430): ERR_EXCEPTION
    <c0a>   DW_AT_const_value : -5
 <2><c0b>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c0c>   DW_AT_name        : (indirect string, offset: 0x86fe1): ERR_BAD_SIZE
    <c10>   DW_AT_const_value : -6
 <2><c11>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c12>   DW_AT_name        : (indirect string, offset: 0x60da3): ERR_BAD_ADDRESS
    <c16>   DW_AT_const_value : -7
 <2><c17>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c18>   DW_AT_name        : (indirect string, offset: 0x59028): ERR_TIME_OUT
    <c1c>   DW_AT_const_value : -8
 <2><c1d>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c1e>   DW_AT_name        : (indirect string, offset: 0x5006a): ERR_BAD_SLAVE_ID
    <c22>   DW_AT_const_value : -9
 <2><c23>: Abbrev Number: 0
 <1><c24>: Abbrev Number: 4 (DW_TAG_typedef)
    <c25>   DW_AT_name        : (indirect string, offset: 0x46168): mb_errot_t
    <c29>   DW_AT_decl_file   : 18
    <c2a>   DW_AT_decl_line   : 108
    <c2b>   DW_AT_decl_column : 2
    <c2c>   DW_AT_type        : <0xbdb>
 <1><c30>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <c31>   DW_AT_encoding    : 7	(unsigned)
    <c32>   DW_AT_byte_size   : 1
    <c33>   DW_AT_type        : <0x64>
    <c37>   DW_AT_decl_file   : 18
    <c38>   DW_AT_decl_line   : 111
    <c39>   DW_AT_decl_column : 1
    <c3a>   DW_AT_sibling     : <0xc57>
 <2><c3e>: Abbrev Number: 11 (DW_TAG_enumerator)
    <c3f>   DW_AT_name        : (indirect string, offset: 0x2d13b): EXC_FUNC_CODE
    <c43>   DW_AT_const_value : 1
 <2><c44>: Abbrev Number: 11 (DW_TAG_enumerator)
    <c45>   DW_AT_name        : (indirect string, offset: 0x58403): EXC_ADDR_RANGE
    <c49>   DW_AT_const_value : 2
 <2><c4a>: Abbrev Number: 11 (DW_TAG_enumerator)
    <c4b>   DW_AT_name        : (indirect string, offset: 0x8809e): EXC_REGS_QUANT
    <c4f>   DW_AT_const_value : 3
 <2><c50>: Abbrev Number: 11 (DW_TAG_enumerator)
    <c51>   DW_AT_name        : (indirect string, offset: 0x5c1fb): EXC_EXECUTE
    <c55>   DW_AT_const_value : 4
 <2><c56>: Abbrev Number: 0
 <1><c57>: Abbrev Number: 28 (DW_TAG_union_type)
    <c58>   DW_AT_byte_size   : 4
    <c59>   DW_AT_decl_file   : 18
    <c5a>   DW_AT_decl_line   : 118
    <c5b>   DW_AT_decl_column : 9
    <c5c>   DW_AT_sibling     : <0xc84>
 <2><c60>: Abbrev Number: 29 (DW_TAG_member)
    <c61>   DW_AT_name        : u8
    <c64>   DW_AT_decl_file   : 18
    <c65>   DW_AT_decl_line   : 119
    <c66>   DW_AT_decl_column : 11
    <c67>   DW_AT_type        : <0xc84>
 <2><c6b>: Abbrev Number: 29 (DW_TAG_member)
    <c6c>   DW_AT_name        : u16
    <c70>   DW_AT_decl_file   : 18
    <c71>   DW_AT_decl_line   : 120
    <c72>   DW_AT_decl_column : 11
    <c73>   DW_AT_type        : <0xc94>
 <2><c77>: Abbrev Number: 29 (DW_TAG_member)
    <c78>   DW_AT_name        : u32
    <c7c>   DW_AT_decl_file   : 18
    <c7d>   DW_AT_decl_line   : 121
    <c7e>   DW_AT_decl_column : 11
    <c7f>   DW_AT_type        : <0x10e>
 <2><c83>: Abbrev Number: 0
 <1><c84>: Abbrev Number: 20 (DW_TAG_array_type)
    <c85>   DW_AT_type        : <0xcf>
    <c89>   DW_AT_sibling     : <0xc94>
 <2><c8d>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <c8e>   DW_AT_type        : <0x30>
    <c92>   DW_AT_upper_bound : 3
 <2><c93>: Abbrev Number: 0
 <1><c94>: Abbrev Number: 20 (DW_TAG_array_type)
    <c95>   DW_AT_type        : <0xec>
    <c99>   DW_AT_sibling     : <0xca4>
 <2><c9d>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <c9e>   DW_AT_type        : <0x30>
    <ca2>   DW_AT_upper_bound : 1
 <2><ca3>: Abbrev Number: 0
 <1><ca4>: Abbrev Number: 4 (DW_TAG_typedef)
    <ca5>   DW_AT_name        : (indirect string, offset: 0x10b83): bytesFields
    <ca9>   DW_AT_decl_file   : 18
    <caa>   DW_AT_decl_line   : 123
    <cab>   DW_AT_decl_column : 3
    <cac>   DW_AT_type        : <0xc57>
 <1><cb0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <cb1>   DW_AT_byte_size   : 16
    <cb2>   DW_AT_decl_file   : 18
    <cb3>   DW_AT_decl_line   : 137
    <cb4>   DW_AT_decl_column : 9
    <cb5>   DW_AT_sibling     : <0xd08>
 <2><cb9>: Abbrev Number: 15 (DW_TAG_member)
    <cba>   DW_AT_name        : (indirect string, offset: 0x82d87): u8id
    <cbe>   DW_AT_decl_file   : 18
    <cbf>   DW_AT_decl_line   : 139
    <cc0>   DW_AT_decl_column : 13
    <cc1>   DW_AT_type        : <0xcf>
    <cc5>   DW_AT_data_member_location: 0
 <2><cc6>: Abbrev Number: 15 (DW_TAG_member)
    <cc7>   DW_AT_name        : (indirect string, offset: 0x25e8f): u8fct
    <ccb>   DW_AT_decl_file   : 18
    <ccc>   DW_AT_decl_line   : 140
    <ccd>   DW_AT_decl_column : 23
    <cce>   DW_AT_type        : <0xb06>
    <cd2>   DW_AT_data_member_location: 1
 <2><cd3>: Abbrev Number: 15 (DW_TAG_member)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x708cf): u16RegAdd
    <cd8>   DW_AT_decl_file   : 18
    <cd9>   DW_AT_decl_line   : 141
    <cda>   DW_AT_decl_column : 14
    <cdb>   DW_AT_type        : <0xec>
    <cdf>   DW_AT_data_member_location: 2
 <2><ce0>: Abbrev Number: 15 (DW_TAG_member)
    <ce1>   DW_AT_name        : (indirect string, offset: 0x8cbae): u16CoilsNo
    <ce5>   DW_AT_decl_file   : 18
    <ce6>   DW_AT_decl_line   : 142
    <ce7>   DW_AT_decl_column : 14
    <ce8>   DW_AT_type        : <0xec>
    <cec>   DW_AT_data_member_location: 4
 <2><ced>: Abbrev Number: 15 (DW_TAG_member)
    <cee>   DW_AT_name        : (indirect string, offset: 0x73659): u16reg
    <cf2>   DW_AT_decl_file   : 18
    <cf3>   DW_AT_decl_line   : 143
    <cf4>   DW_AT_decl_column : 15
    <cf5>   DW_AT_type        : <0xd08>
    <cf9>   DW_AT_data_member_location: 8
 <2><cfa>: Abbrev Number: 15 (DW_TAG_member)
    <cfb>   DW_AT_name        : (indirect string, offset: 0x65651): u32CurrentTask
    <cff>   DW_AT_decl_file   : 18
    <d00>   DW_AT_decl_line   : 144
    <d01>   DW_AT_decl_column : 15
    <d02>   DW_AT_type        : <0xd0e>
    <d06>   DW_AT_data_member_location: 12
 <2><d07>: Abbrev Number: 0
 <1><d08>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <d09>   DW_AT_byte_size   : 4
    <d0a>   DW_AT_type        : <0xec>
 <1><d0e>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <d0f>   DW_AT_byte_size   : 4
    <d10>   DW_AT_type        : <0x10e>
 <1><d14>: Abbrev Number: 4 (DW_TAG_typedef)
    <d15>   DW_AT_name        : (indirect string, offset: 0x679bf): modbus_t
    <d19>   DW_AT_decl_file   : 18
    <d1a>   DW_AT_decl_line   : 150
    <d1b>   DW_AT_decl_column : 1
    <d1c>   DW_AT_type        : <0xcb0>
 <1><d20>: Abbrev Number: 30 (DW_TAG_structure_type)
    <d21>   DW_AT_byte_size   : 324
    <d23>   DW_AT_decl_file   : 18
    <d24>   DW_AT_decl_line   : 161
    <d25>   DW_AT_decl_column : 9
    <d26>   DW_AT_sibling     : <0xe64>
 <2><d2a>: Abbrev Number: 15 (DW_TAG_member)
    <d2b>   DW_AT_name        : (indirect string, offset: 0x1f910): uModbusType
    <d2f>   DW_AT_decl_file   : 18
    <d30>   DW_AT_decl_line   : 164
    <d31>   DW_AT_decl_column : 19
    <d32>   DW_AT_type        : <0xab7>
    <d36>   DW_AT_data_member_location: 0
 <2><d37>: Abbrev Number: 15 (DW_TAG_member)
    <d38>   DW_AT_name        : (indirect string, offset: 0x5502b): port
    <d3c>   DW_AT_decl_file   : 18
    <d3d>   DW_AT_decl_line   : 165
    <d3e>   DW_AT_decl_column : 22
    <d3f>   DW_AT_type        : <0xe64>
    <d43>   DW_AT_data_member_location: 4
 <2><d44>: Abbrev Number: 15 (DW_TAG_member)
    <d45>   DW_AT_name        : (indirect string, offset: 0x82d87): u8id
    <d49>   DW_AT_decl_file   : 18
    <d4a>   DW_AT_decl_line   : 166
    <d4b>   DW_AT_decl_column : 10
    <d4c>   DW_AT_type        : <0xcf>
    <d50>   DW_AT_data_member_location: 8
 <2><d51>: Abbrev Number: 15 (DW_TAG_member)
    <d52>   DW_AT_name        : (indirect string, offset: 0x1801f): EN_Port
    <d56>   DW_AT_decl_file   : 18
    <d57>   DW_AT_decl_line   : 167
    <d58>   DW_AT_decl_column : 16
    <d59>   DW_AT_type        : <0xe6a>
    <d5d>   DW_AT_data_member_location: 12
 <2><d5e>: Abbrev Number: 15 (DW_TAG_member)
    <d5f>   DW_AT_name        : (indirect string, offset: 0x5b8dc): EN_Pin
    <d63>   DW_AT_decl_file   : 18
    <d64>   DW_AT_decl_line   : 168
    <d65>   DW_AT_decl_column : 11
    <d66>   DW_AT_type        : <0xec>
    <d6a>   DW_AT_data_member_location: 16
 <2><d6b>: Abbrev Number: 15 (DW_TAG_member)
    <d6c>   DW_AT_name        : (indirect string, offset: 0x4d029): i8lastError
    <d70>   DW_AT_decl_file   : 18
    <d71>   DW_AT_decl_line   : 169
    <d72>   DW_AT_decl_column : 13
    <d73>   DW_AT_type        : <0xc24>
    <d77>   DW_AT_data_member_location: 18
 <2><d78>: Abbrev Number: 15 (DW_TAG_member)
    <d79>   DW_AT_name        : (indirect string, offset: 0x1fd12): u8Buffer
    <d7d>   DW_AT_decl_file   : 18
    <d7e>   DW_AT_decl_line   : 170
    <d7f>   DW_AT_decl_column : 10
    <d80>   DW_AT_type        : <0xb5d>
    <d84>   DW_AT_data_member_location: 19
 <2><d85>: Abbrev Number: 15 (DW_TAG_member)
    <d86>   DW_AT_name        : (indirect string, offset: 0x41c98): u8BufferSize
    <d8a>   DW_AT_decl_file   : 18
    <d8b>   DW_AT_decl_line   : 171
    <d8c>   DW_AT_decl_column : 10
    <d8d>   DW_AT_type        : <0xcf>
    <d91>   DW_AT_data_member_location: 147
 <2><d92>: Abbrev Number: 15 (DW_TAG_member)
    <d93>   DW_AT_name        : (indirect string, offset: 0x8dd89): u8lastRec
    <d97>   DW_AT_decl_file   : 18
    <d98>   DW_AT_decl_line   : 172
    <d99>   DW_AT_decl_column : 10
    <d9a>   DW_AT_type        : <0xcf>
    <d9e>   DW_AT_data_member_location: 148
 <2><d9f>: Abbrev Number: 15 (DW_TAG_member)
    <da0>   DW_AT_name        : (indirect string, offset: 0x23bdc): u16regs
    <da4>   DW_AT_decl_file   : 18
    <da5>   DW_AT_decl_line   : 173
    <da6>   DW_AT_decl_column : 12
    <da7>   DW_AT_type        : <0xd08>
    <dab>   DW_AT_data_member_location: 152
 <2><dac>: Abbrev Number: 15 (DW_TAG_member)
    <dad>   DW_AT_name        : (indirect string, offset: 0x7451e): u16InCnt
    <db1>   DW_AT_decl_file   : 18
    <db2>   DW_AT_decl_line   : 174
    <db3>   DW_AT_decl_column : 11
    <db4>   DW_AT_type        : <0xec>
    <db8>   DW_AT_data_member_location: 156
 <2><db9>: Abbrev Number: 15 (DW_TAG_member)
    <dba>   DW_AT_name        : (indirect string, offset: 0x20b9d): u16OutCnt
    <dbe>   DW_AT_decl_file   : 18
    <dbf>   DW_AT_decl_line   : 174
    <dc0>   DW_AT_decl_column : 21
    <dc1>   DW_AT_type        : <0xec>
    <dc5>   DW_AT_data_member_location: 158
 <2><dc6>: Abbrev Number: 15 (DW_TAG_member)
    <dc7>   DW_AT_name        : (indirect string, offset: 0x7f0e1): u16errCnt
    <dcb>   DW_AT_decl_file   : 18
    <dcc>   DW_AT_decl_line   : 174
    <dcd>   DW_AT_decl_column : 32
    <dce>   DW_AT_type        : <0xec>
    <dd2>   DW_AT_data_member_location: 160
 <2><dd3>: Abbrev Number: 15 (DW_TAG_member)
    <dd4>   DW_AT_name        : (indirect string, offset: 0x89569): u16timeOut
    <dd8>   DW_AT_decl_file   : 18
    <dd9>   DW_AT_decl_line   : 175
    <dda>   DW_AT_decl_column : 11
    <ddb>   DW_AT_type        : <0xec>
    <ddf>   DW_AT_data_member_location: 162
 <2><de0>: Abbrev Number: 15 (DW_TAG_member)
    <de1>   DW_AT_name        : (indirect string, offset: 0x6eceb): u16regsize
    <de5>   DW_AT_decl_file   : 18
    <de6>   DW_AT_decl_line   : 176
    <de7>   DW_AT_decl_column : 11
    <de8>   DW_AT_type        : <0xec>
    <dec>   DW_AT_data_member_location: 164
 <2><ded>: Abbrev Number: 15 (DW_TAG_member)
    <dee>   DW_AT_name        : (indirect string, offset: 0x48fe4): dataRX
    <df2>   DW_AT_decl_file   : 18
    <df3>   DW_AT_decl_line   : 177
    <df4>   DW_AT_decl_column : 10
    <df5>   DW_AT_type        : <0xcf>
    <df9>   DW_AT_data_member_location: 166
 <2><dfa>: Abbrev Number: 15 (DW_TAG_member)
    <dfb>   DW_AT_name        : (indirect string, offset: 0x5fdaf): i8state
    <dff>   DW_AT_decl_file   : 18
    <e00>   DW_AT_decl_line   : 178
    <e01>   DW_AT_decl_column : 9
    <e02>   DW_AT_type        : <0xc3>
    <e06>   DW_AT_data_member_location: 167
 <2><e07>: Abbrev Number: 15 (DW_TAG_member)
    <e08>   DW_AT_name        : (indirect string, offset: 0x6d38c): QueueTelegramHandle
    <e0c>   DW_AT_decl_file   : 18
    <e0d>   DW_AT_decl_line   : 183
    <e0e>   DW_AT_decl_column : 21
    <e0f>   DW_AT_type        : <0x2bf>
    <e13>   DW_AT_data_member_location: 168
 <2><e14>: Abbrev Number: 15 (DW_TAG_member)
    <e15>   DW_AT_name        : (indirect string, offset: 0x38169): myTaskModbusAHandle
    <e19>   DW_AT_decl_file   : 18
    <e1a>   DW_AT_decl_line   : 186
    <e1b>   DW_AT_decl_column : 15
    <e1c>   DW_AT_type        : <0x2a7>
    <e20>   DW_AT_data_member_location: 172
 <2><e21>: Abbrev Number: 15 (DW_TAG_member)
    <e22>   DW_AT_name        : (indirect string, offset: 0x8f12a): xTimerT35
    <e26>   DW_AT_decl_file   : 18
    <e27>   DW_AT_decl_line   : 188
    <e28>   DW_AT_decl_column : 15
    <e29>   DW_AT_type        : <0xa40>
    <e2d>   DW_AT_data_member_location: 176
 <2><e2e>: Abbrev Number: 15 (DW_TAG_member)
    <e2f>   DW_AT_name        : (indirect string, offset: 0x7c0d4): xTimerTimeout
    <e33>   DW_AT_decl_file   : 18
    <e34>   DW_AT_decl_line   : 190
    <e35>   DW_AT_decl_column : 15
    <e36>   DW_AT_type        : <0xa40>
    <e3a>   DW_AT_data_member_location: 180
 <2><e3b>: Abbrev Number: 15 (DW_TAG_member)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x7d867): ModBusSphrHandle
    <e40>   DW_AT_decl_file   : 18
    <e41>   DW_AT_decl_line   : 192
    <e42>   DW_AT_decl_column : 18
    <e43>   DW_AT_type        : <0x2b3>
    <e47>   DW_AT_data_member_location: 184
 <2><e48>: Abbrev Number: 15 (DW_TAG_member)
    <e49>   DW_AT_name        : (indirect string, offset: 0x460aa): xBufferRX
    <e4d>   DW_AT_decl_file   : 18
    <e4e>   DW_AT_decl_line   : 194
    <e4f>   DW_AT_decl_column : 21
    <e50>   DW_AT_type        : <0xb74>
    <e54>   DW_AT_data_member_location: 188
 <2><e55>: Abbrev Number: 31 (DW_TAG_member)
    <e56>   DW_AT_name        : (indirect string, offset: 0x7b330): xTypeHW
    <e5a>   DW_AT_decl_file   : 18
    <e5b>   DW_AT_decl_line   : 196
    <e5c>   DW_AT_decl_column : 16
    <e5d>   DW_AT_type        : <0xa90>
    <e61>   DW_AT_data_member_location: 320
 <2><e63>: Abbrev Number: 0
 <1><e64>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <e65>   DW_AT_byte_size   : 4
    <e66>   DW_AT_type        : <0x9dd>
 <1><e6a>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <e6b>   DW_AT_byte_size   : 4
    <e6c>   DW_AT_type        : <0x5c3>
 <1><e70>: Abbrev Number: 4 (DW_TAG_typedef)
    <e71>   DW_AT_name        : (indirect string, offset: 0xe5c8): modbusHandler_t
    <e75>   DW_AT_decl_file   : 18
    <e76>   DW_AT_decl_line   : 207
    <e77>   DW_AT_decl_column : 1
    <e78>   DW_AT_type        : <0xd20>
 <1><e7c>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <e7d>   DW_AT_encoding    : 7	(unsigned)
    <e7e>   DW_AT_byte_size   : 1
    <e7f>   DW_AT_type        : <0x64>
    <e83>   DW_AT_decl_file   : 18
    <e84>   DW_AT_decl_line   : 211
    <e85>   DW_AT_decl_column : 1
    <e86>   DW_AT_sibling     : <0xe9d>
 <2><e8a>: Abbrev Number: 11 (DW_TAG_enumerator)
    <e8b>   DW_AT_name        : (indirect string, offset: 0xbd49): RESPONSE_SIZE
    <e8f>   DW_AT_const_value : 6
 <2><e90>: Abbrev Number: 11 (DW_TAG_enumerator)
    <e91>   DW_AT_name        : (indirect string, offset: 0x8aeb3): EXCEPTION_SIZE
    <e95>   DW_AT_const_value : 3
 <2><e96>: Abbrev Number: 11 (DW_TAG_enumerator)
    <e97>   DW_AT_name        : (indirect string, offset: 0x58441): CHECKSUM_SIZE
    <e9b>   DW_AT_const_value : 2
 <2><e9c>: Abbrev Number: 0
 <1><e9d>: Abbrev Number: 20 (DW_TAG_array_type)
    <e9e>   DW_AT_type        : <0xead>
    <ea2>   DW_AT_sibling     : <0xead>
 <2><ea6>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <ea7>   DW_AT_type        : <0x30>
    <eab>   DW_AT_upper_bound : 1
 <2><eac>: Abbrev Number: 0
 <1><ead>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <eae>   DW_AT_byte_size   : 4
    <eaf>   DW_AT_type        : <0xe70>
 <1><eb3>: Abbrev Number: 32 (DW_TAG_variable)
    <eb4>   DW_AT_name        : (indirect string, offset: 0x86222): mHandlers
    <eb8>   DW_AT_decl_file   : 18
    <eb9>   DW_AT_decl_line   : 224
    <eba>   DW_AT_decl_column : 18
    <ebb>   DW_AT_type        : <0xe9d>
    <ebf>   DW_AT_external    : 1
    <ebf>   DW_AT_location    : 5 byte block: 3 7c e 0 20 	(DW_OP_addr: 20000e7c)
 <1><ec5>: Abbrev Number: 19 (DW_TAG_variable)
    <ec6>   DW_AT_name        : (indirect string, offset: 0x5efcf): numberHandlers
    <eca>   DW_AT_decl_file   : 18
    <ecb>   DW_AT_decl_line   : 260
    <ecd>   DW_AT_decl_column : 16
    <ece>   DW_AT_type        : <0xcf>
    <ed2>   DW_AT_external    : 1
    <ed2>   DW_AT_declaration : 1
 <1><ed2>: Abbrev Number: 32 (DW_TAG_variable)
    <ed3>   DW_AT_name        : (indirect string, offset: 0x4de26): QueueTelegram_attributes
    <ed7>   DW_AT_decl_file   : 1
    <ed8>   DW_AT_decl_line   : 40
    <ed9>   DW_AT_decl_column : 28
    <eda>   DW_AT_type        : <0x439>
    <ede>   DW_AT_external    : 1
    <ede>   DW_AT_location    : 5 byte block: 3 dc a0 0 8 	(DW_OP_addr: 800a0dc)
 <1><ee4>: Abbrev Number: 32 (DW_TAG_variable)
    <ee5>   DW_AT_name        : (indirect string, offset: 0x8adc9): myTaskModbusA_attributes
    <ee9>   DW_AT_decl_file   : 1
    <eea>   DW_AT_decl_line   : 45
    <eeb>   DW_AT_decl_column : 22
    <eec>   DW_AT_type        : <0x374>
    <ef0>   DW_AT_external    : 1
    <ef0>   DW_AT_location    : 5 byte block: 3 f4 a0 0 8 	(DW_OP_addr: 800a0f4)
 <1><ef6>: Abbrev Number: 32 (DW_TAG_variable)
    <ef7>   DW_AT_name        : (indirect string, offset: 0x468bb): myTaskModbusA_attributesTCP
    <efb>   DW_AT_decl_file   : 1
    <efc>   DW_AT_decl_line   : 51
    <efd>   DW_AT_decl_column : 22
    <efe>   DW_AT_type        : <0x374>
    <f02>   DW_AT_external    : 1
    <f02>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><f08>: Abbrev Number: 32 (DW_TAG_variable)
    <f09>   DW_AT_name        : (indirect string, offset: 0x1605e): myTaskModbusB_attributes
    <f0d>   DW_AT_decl_file   : 1
    <f0e>   DW_AT_decl_line   : 61
    <f0f>   DW_AT_decl_column : 22
    <f10>   DW_AT_type        : <0x374>
    <f14>   DW_AT_external    : 1
    <f14>   DW_AT_location    : 5 byte block: 3 18 a1 0 8 	(DW_OP_addr: 800a118)
 <1><f1a>: Abbrev Number: 32 (DW_TAG_variable)
    <f1b>   DW_AT_name        : (indirect string, offset: 0x6e26f): myTaskModbusB_attributesTCP
    <f1f>   DW_AT_decl_file   : 1
    <f20>   DW_AT_decl_line   : 68
    <f21>   DW_AT_decl_column : 22
    <f22>   DW_AT_type        : <0x374>
    <f26>   DW_AT_external    : 1
    <f26>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><f2c>: Abbrev Number: 32 (DW_TAG_variable)
    <f2d>   DW_AT_name        : (indirect string, offset: 0x1ad0d): ModBusSphr_attributes
    <f31>   DW_AT_decl_file   : 1
    <f32>   DW_AT_decl_line   : 78
    <f33>   DW_AT_decl_column : 25
    <f34>   DW_AT_type        : <0x3c8>
    <f38>   DW_AT_external    : 1
    <f38>   DW_AT_location    : 5 byte block: 3 3c a1 0 8 	(DW_OP_addr: 800a13c)
 <1><f3e>: Abbrev Number: 33 (DW_TAG_variable)
    <f3f>   DW_AT_specification: <0xec5>
    <f43>   DW_AT_decl_file   : 1
    <f44>   DW_AT_decl_line   : 83
    <f45>   DW_AT_decl_column : 9
    <f46>   DW_AT_location    : 5 byte block: 3 c0 0 0 20 	(DW_OP_addr: 200000c0)
 <1><f4c>: Abbrev Number: 20 (DW_TAG_array_type)
    <f4d>   DW_AT_type        : <0x6b>
    <f51>   DW_AT_sibling     : <0xf5c>
 <2><f55>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <f56>   DW_AT_type        : <0x30>
    <f5a>   DW_AT_upper_bound : 7
 <2><f5b>: Abbrev Number: 0
 <1><f5c>: Abbrev Number: 5 (DW_TAG_const_type)
    <f5d>   DW_AT_type        : <0xf4c>
 <1><f61>: Abbrev Number: 32 (DW_TAG_variable)
    <f62>   DW_AT_name        : (indirect string, offset: 0x1a254): fctsupported
    <f66>   DW_AT_decl_file   : 1
    <f67>   DW_AT_decl_line   : 179
    <f68>   DW_AT_decl_column : 21
    <f69>   DW_AT_type        : <0xf5c>
    <f6d>   DW_AT_external    : 1
    <f6d>   DW_AT_location    : 5 byte block: 3 4c a1 0 8 	(DW_OP_addr: 800a14c)
 <1><f73>: Abbrev Number: 34 (DW_TAG_subprogram)
    <f74>   DW_AT_name        : (indirect string, offset: 0x2e9bb): process_FC16
    <f78>   DW_AT_decl_file   : 1
    <f79>   DW_AT_decl_line   : 1767
    <f7b>   DW_AT_decl_column : 8
    <f7c>   DW_AT_prototyped  : 1
    <f7c>   DW_AT_type        : <0xc3>
    <f80>   DW_AT_low_pc      : 0x8001c72
    <f84>   DW_AT_high_pc     : 0xac
    <f88>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f8a>   DW_AT_GNU_all_tail_call_sites: 1
    <f8a>   DW_AT_sibling     : <0xfed>
 <2><f8e>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <f8f>   DW_AT_name        : (indirect string, offset: 0x1199): modH
    <f93>   DW_AT_decl_file   : 1
    <f94>   DW_AT_decl_line   : 1767
    <f96>   DW_AT_decl_column : 38
    <f97>   DW_AT_type        : <0xead>
    <f9b>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><f9e>: Abbrev Number: 36 (DW_TAG_variable)
    <f9f>   DW_AT_name        : (indirect string, offset: 0x51f34): u16StartAdd
    <fa3>   DW_AT_decl_file   : 1
    <fa4>   DW_AT_decl_line   : 1769
    <fa6>   DW_AT_decl_column : 14
    <fa7>   DW_AT_type        : <0xec>
    <fab>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><fae>: Abbrev Number: 36 (DW_TAG_variable)
    <faf>   DW_AT_name        : (indirect string, offset: 0x660b5): u16regsno
    <fb3>   DW_AT_decl_file   : 1
    <fb4>   DW_AT_decl_line   : 1770
    <fb6>   DW_AT_decl_column : 14
    <fb7>   DW_AT_type        : <0xec>
    <fbb>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <2><fbe>: Abbrev Number: 36 (DW_TAG_variable)
    <fbf>   DW_AT_name        : (indirect string, offset: 0x63a3e): u8CopyBufferSize
    <fc3>   DW_AT_decl_file   : 1
    <fc4>   DW_AT_decl_line   : 1771
    <fc6>   DW_AT_decl_column : 13
    <fc7>   DW_AT_type        : <0xcf>
    <fcb>   DW_AT_location    : 2 byte block: 91 71 	(DW_OP_fbreg: -15)
 <2><fce>: Abbrev Number: 37 (DW_TAG_variable)
    <fcf>   DW_AT_name        : i
    <fd1>   DW_AT_decl_file   : 1
    <fd2>   DW_AT_decl_line   : 1772
    <fd4>   DW_AT_decl_column : 14
    <fd5>   DW_AT_type        : <0xec>
    <fd9>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><fdc>: Abbrev Number: 36 (DW_TAG_variable)
    <fdd>   DW_AT_name        : (indirect string, offset: 0x81f02): temp
    <fe1>   DW_AT_decl_file   : 1
    <fe2>   DW_AT_decl_line   : 1773
    <fe4>   DW_AT_decl_column : 14
    <fe5>   DW_AT_type        : <0xec>
    <fe9>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><fec>: Abbrev Number: 0
 <1><fed>: Abbrev Number: 34 (DW_TAG_subprogram)
    <fee>   DW_AT_name        : (indirect string, offset: 0x2e9ae): process_FC15
    <ff2>   DW_AT_decl_file   : 1
    <ff3>   DW_AT_decl_line   : 1710
    <ff5>   DW_AT_decl_column : 8
    <ff6>   DW_AT_prototyped  : 1
    <ff6>   DW_AT_type        : <0xc3>
    <ffa>   DW_AT_low_pc      : 0x8001b56
    <ffe>   DW_AT_high_pc     : 0x11c
    <1002>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1004>   DW_AT_GNU_all_tail_call_sites: 1
    <1004>   DW_AT_sibling     : <0x10b9>
 <2><1008>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <1009>   DW_AT_name        : (indirect string, offset: 0x1199): modH
    <100d>   DW_AT_decl_file   : 1
    <100e>   DW_AT_decl_line   : 1710
    <1010>   DW_AT_decl_column : 39
    <1011>   DW_AT_type        : <0xead>
    <1015>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><1018>: Abbrev Number: 36 (DW_TAG_variable)
    <1019>   DW_AT_name        : (indirect string, offset: 0x6cf61): u8currentBit
    <101d>   DW_AT_decl_file   : 1
    <101e>   DW_AT_decl_line   : 1712
    <1020>   DW_AT_decl_column : 13
    <1021>   DW_AT_type        : <0xcf>
    <1025>   DW_AT_location    : 2 byte block: 91 69 	(DW_OP_fbreg: -23)
 <2><1028>: Abbrev Number: 36 (DW_TAG_variable)
    <1029>   DW_AT_name        : (indirect string, offset: 0x72515): u8frameByte
    <102d>   DW_AT_decl_file   : 1
    <102e>   DW_AT_decl_line   : 1712
    <1030>   DW_AT_decl_column : 27
    <1031>   DW_AT_type        : <0xcf>
    <1035>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><1038>: Abbrev Number: 36 (DW_TAG_variable)
    <1039>   DW_AT_name        : (indirect string, offset: 0x36700): u8bitsno
    <103d>   DW_AT_decl_file   : 1
    <103e>   DW_AT_decl_line   : 1712
    <1040>   DW_AT_decl_column : 40
    <1041>   DW_AT_type        : <0xcf>
    <1045>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><1048>: Abbrev Number: 36 (DW_TAG_variable)
    <1049>   DW_AT_name        : (indirect string, offset: 0x36850): u16currentRegister
    <104d>   DW_AT_decl_file   : 1
    <104e>   DW_AT_decl_line   : 1713
    <1050>   DW_AT_decl_column : 14
    <1051>   DW_AT_type        : <0xec>
    <1055>   DW_AT_location    : 2 byte block: 91 6a 	(DW_OP_fbreg: -22)
 <2><1058>: Abbrev Number: 36 (DW_TAG_variable)
    <1059>   DW_AT_name        : (indirect string, offset: 0x63a3e): u8CopyBufferSize
    <105d>   DW_AT_decl_file   : 1
    <105e>   DW_AT_decl_line   : 1714
    <1060>   DW_AT_decl_column : 13
    <1061>   DW_AT_type        : <0xcf>
    <1065>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><1068>: Abbrev Number: 36 (DW_TAG_variable)
    <1069>   DW_AT_name        : (indirect string, offset: 0x6af3a): u16currentCoil
    <106d>   DW_AT_decl_file   : 1
    <106e>   DW_AT_decl_line   : 1715
    <1070>   DW_AT_decl_column : 14
    <1071>   DW_AT_type        : <0xec>
    <1075>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1078>: Abbrev Number: 36 (DW_TAG_variable)
    <1079>   DW_AT_name        : (indirect string, offset: 0x4d259): u16coil
    <107d>   DW_AT_decl_file   : 1
    <107e>   DW_AT_decl_line   : 1715
    <1080>   DW_AT_decl_column : 30
    <1081>   DW_AT_type        : <0xec>
    <1085>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1088>: Abbrev Number: 36 (DW_TAG_variable)
    <1089>   DW_AT_name        : (indirect string, offset: 0x8f585): bTemp
    <108d>   DW_AT_decl_file   : 1
    <108e>   DW_AT_decl_line   : 1716
    <1090>   DW_AT_decl_column : 10
    <1091>   DW_AT_type        : <0xb6d>
    <1095>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><1098>: Abbrev Number: 36 (DW_TAG_variable)
    <1099>   DW_AT_name        : (indirect string, offset: 0x83930): u16StartCoil
    <109d>   DW_AT_decl_file   : 1
    <109e>   DW_AT_decl_line   : 1719
    <10a0>   DW_AT_decl_column : 14
    <10a1>   DW_AT_type        : <0xec>
    <10a5>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <2><10a8>: Abbrev Number: 36 (DW_TAG_variable)
    <10a9>   DW_AT_name        : (indirect string, offset: 0x5d37b): u16Coilno
    <10ad>   DW_AT_decl_file   : 1
    <10ae>   DW_AT_decl_line   : 1720
    <10b0>   DW_AT_decl_column : 14
    <10b1>   DW_AT_type        : <0xec>
    <10b5>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><10b8>: Abbrev Number: 0
 <1><10b9>: Abbrev Number: 34 (DW_TAG_subprogram)
    <10ba>   DW_AT_name        : (indirect string, offset: 0x44cd2): process_FC6
    <10be>   DW_AT_decl_file   : 1
    <10bf>   DW_AT_decl_line   : 1684
    <10c1>   DW_AT_decl_column : 8
    <10c2>   DW_AT_prototyped  : 1
    <10c2>   DW_AT_type        : <0xc3>
    <10c6>   DW_AT_low_pc      : 0x8001af2
    <10ca>   DW_AT_high_pc     : 0x64
    <10ce>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <10d0>   DW_AT_GNU_all_tail_call_sites: 1
    <10d0>   DW_AT_sibling     : <0x1115>
 <2><10d4>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <10d5>   DW_AT_name        : (indirect string, offset: 0x1199): modH
    <10d9>   DW_AT_decl_file   : 1
    <10da>   DW_AT_decl_line   : 1684
    <10dc>   DW_AT_decl_column : 37
    <10dd>   DW_AT_type        : <0xead>
    <10e1>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><10e4>: Abbrev Number: 36 (DW_TAG_variable)
    <10e5>   DW_AT_name        : (indirect string, offset: 0x2424a): u16add
    <10e9>   DW_AT_decl_file   : 1
    <10ea>   DW_AT_decl_line   : 1687
    <10ec>   DW_AT_decl_column : 14
    <10ed>   DW_AT_type        : <0xec>
    <10f1>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><10f4>: Abbrev Number: 36 (DW_TAG_variable)
    <10f5>   DW_AT_name        : (indirect string, offset: 0x63a3e): u8CopyBufferSize
    <10f9>   DW_AT_decl_file   : 1
    <10fa>   DW_AT_decl_line   : 1688
    <10fc>   DW_AT_decl_column : 13
    <10fd>   DW_AT_type        : <0xcf>
    <1101>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><1104>: Abbrev Number: 36 (DW_TAG_variable)
    <1105>   DW_AT_name        : (indirect string, offset: 0x11a36): u16val
    <1109>   DW_AT_decl_file   : 1
    <110a>   DW_AT_decl_line   : 1689
    <110c>   DW_AT_decl_column : 14
    <110d>   DW_AT_type        : <0xec>
    <1111>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1114>: Abbrev Number: 0
 <1><1115>: Abbrev Number: 34 (DW_TAG_subprogram)
    <1116>   DW_AT_name        : (indirect string, offset: 0x44cc6): process_FC5
    <111a>   DW_AT_decl_file   : 1
    <111b>   DW_AT_decl_line   : 1650
    <111d>   DW_AT_decl_column : 8
    <111e>   DW_AT_prototyped  : 1
    <111e>   DW_AT_type        : <0xc3>
    <1122>   DW_AT_low_pc      : 0x8001a40
    <1126>   DW_AT_high_pc     : 0xb2
    <112a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <112c>   DW_AT_GNU_all_tail_call_sites: 1
    <112c>   DW_AT_sibling     : <0x1181>
 <2><1130>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <1131>   DW_AT_name        : (indirect string, offset: 0x1199): modH
    <1135>   DW_AT_decl_file   : 1
    <1136>   DW_AT_decl_line   : 1650
    <1138>   DW_AT_decl_column : 38
    <1139>   DW_AT_type        : <0xead>
    <113d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1140>: Abbrev Number: 36 (DW_TAG_variable)
    <1141>   DW_AT_name        : (indirect string, offset: 0x6cf61): u8currentBit
    <1145>   DW_AT_decl_file   : 1
    <1146>   DW_AT_decl_line   : 1652
    <1148>   DW_AT_decl_column : 13
    <1149>   DW_AT_type        : <0xcf>
    <114d>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><1150>: Abbrev Number: 36 (DW_TAG_variable)
    <1151>   DW_AT_name        : (indirect string, offset: 0x36850): u16currentRegister
    <1155>   DW_AT_decl_file   : 1
    <1156>   DW_AT_decl_line   : 1653
    <1158>   DW_AT_decl_column : 14
    <1159>   DW_AT_type        : <0xec>
    <115d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1160>: Abbrev Number: 36 (DW_TAG_variable)
    <1161>   DW_AT_name        : (indirect string, offset: 0x63a3e): u8CopyBufferSize
    <1165>   DW_AT_decl_file   : 1
    <1166>   DW_AT_decl_line   : 1654
    <1168>   DW_AT_decl_column : 13
    <1169>   DW_AT_type        : <0xcf>
    <116d>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <2><1170>: Abbrev Number: 36 (DW_TAG_variable)
    <1171>   DW_AT_name        : (indirect string, offset: 0x4d259): u16coil
    <1175>   DW_AT_decl_file   : 1
    <1176>   DW_AT_decl_line   : 1655
    <1178>   DW_AT_decl_column : 14
    <1179>   DW_AT_type        : <0xec>
    <117d>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><1180>: Abbrev Number: 0
 <1><1181>: Abbrev Number: 34 (DW_TAG_subprogram)
    <1182>   DW_AT_name        : (indirect string, offset: 0x44c9e): process_FC3
    <1186>   DW_AT_decl_file   : 1
    <1187>   DW_AT_decl_line   : 1618
    <1189>   DW_AT_decl_column : 8
    <118a>   DW_AT_prototyped  : 1
    <118a>   DW_AT_type        : <0xc3>
    <118e>   DW_AT_low_pc      : 0x800196a
    <1192>   DW_AT_high_pc     : 0xd6
    <1196>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1198>   DW_AT_GNU_all_tail_call_sites: 1
    <1198>   DW_AT_sibling     : <0x11eb>
 <2><119c>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <119d>   DW_AT_name        : (indirect string, offset: 0x1199): modH
    <11a1>   DW_AT_decl_file   : 1
    <11a2>   DW_AT_decl_line   : 1618
    <11a4>   DW_AT_decl_column : 37
    <11a5>   DW_AT_type        : <0xead>
    <11a9>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><11ac>: Abbrev Number: 36 (DW_TAG_variable)
    <11ad>   DW_AT_name        : (indirect string, offset: 0x51f34): u16StartAdd
    <11b1>   DW_AT_decl_file   : 1
    <11b2>   DW_AT_decl_line   : 1621
    <11b4>   DW_AT_decl_column : 14
    <11b5>   DW_AT_type        : <0xec>
    <11b9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><11bc>: Abbrev Number: 36 (DW_TAG_variable)
    <11bd>   DW_AT_name        : (indirect string, offset: 0x17093): u8regsno
    <11c1>   DW_AT_decl_file   : 1
    <11c2>   DW_AT_decl_line   : 1622
    <11c4>   DW_AT_decl_column : 13
    <11c5>   DW_AT_type        : <0xcf>
    <11c9>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><11cc>: Abbrev Number: 36 (DW_TAG_variable)
    <11cd>   DW_AT_name        : (indirect string, offset: 0x63a3e): u8CopyBufferSize
    <11d1>   DW_AT_decl_file   : 1
    <11d2>   DW_AT_decl_line   : 1623
    <11d4>   DW_AT_decl_column : 13
    <11d5>   DW_AT_type        : <0xcf>
    <11d9>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <2><11dc>: Abbrev Number: 37 (DW_TAG_variable)
    <11dd>   DW_AT_name        : i
    <11df>   DW_AT_decl_file   : 1
    <11e0>   DW_AT_decl_line   : 1624
    <11e2>   DW_AT_decl_column : 14
    <11e3>   DW_AT_type        : <0xec>
    <11e7>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><11ea>: Abbrev Number: 0
 <1><11eb>: Abbrev Number: 34 (DW_TAG_subprogram)
    <11ec>   DW_AT_name        : (indirect string, offset: 0x44c92): process_FC1
    <11f0>   DW_AT_decl_file   : 1
    <11f1>   DW_AT_decl_line   : 1562
    <11f3>   DW_AT_decl_column : 8
    <11f4>   DW_AT_prototyped  : 1
    <11f4>   DW_AT_type        : <0xc3>
    <11f8>   DW_AT_low_pc      : 0x8001800
    <11fc>   DW_AT_high_pc     : 0x16a
    <1200>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1202>   DW_AT_GNU_all_tail_call_sites: 1
    <1202>   DW_AT_sibling     : <0x12a7>
 <2><1206>: Abbrev Number: 35 (DW_TAG_formal_parameter)
    <1207>   DW_AT_name        : (indirect string, offset: 0x1199): modH
    <120b>   DW_AT_decl_file   : 1
    <120c>   DW_AT_decl_line   : 1562
    <120e>   DW_AT_decl_column : 37
    <120f>   DW_AT_type        : <0xead>
    <1213>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><1216>: Abbrev Number: 36 (DW_TAG_variable)
    <1217>   DW_AT_name        : (indirect string, offset: 0x36850): u16currentRegister
    <121b>   DW_AT_decl_file   : 1
    <121c>   DW_AT_decl_line   : 1564
    <121e>   DW_AT_decl_column : 14
    <121f>   DW_AT_type        : <0xec>
    <1223>   DW_AT_location    : 2 byte block: 91 6a 	(DW_OP_fbreg: -22)
 <2><1226>: Abbrev Number: 36 (DW_TAG_variable)
    <1227>   DW_AT_name        : (indirect string, offset: 0x6cf61): u8currentBit
    <122b>   DW_AT_decl_file   : 1
    <122c>   DW_AT_decl_line   : 1565
    <122e>   DW_AT_decl_column : 13
    <122f>   DW_AT_type        : <0xcf>
    <1233>   DW_AT_location    : 2 byte block: 91 69 	(DW_OP_fbreg: -23)
 <2><1236>: Abbrev Number: 36 (DW_TAG_variable)
    <1237>   DW_AT_name        : (indirect string, offset: 0x271a4): u8bytesno
    <123b>   DW_AT_decl_file   : 1
    <123c>   DW_AT_decl_line   : 1565
    <123e>   DW_AT_decl_column : 27
    <123f>   DW_AT_type        : <0xcf>
    <1243>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><1246>: Abbrev Number: 36 (DW_TAG_variable)
    <1247>   DW_AT_name        : (indirect string, offset: 0x36700): u8bitsno
    <124b>   DW_AT_decl_file   : 1
    <124c>   DW_AT_decl_line   : 1565
    <124e>   DW_AT_decl_column : 38
    <124f>   DW_AT_type        : <0xcf>
    <1253>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><1256>: Abbrev Number: 36 (DW_TAG_variable)
    <1257>   DW_AT_name        : (indirect string, offset: 0x63a3e): u8CopyBufferSize
    <125b>   DW_AT_decl_file   : 1
    <125c>   DW_AT_decl_line   : 1566
    <125e>   DW_AT_decl_column : 13
    <125f>   DW_AT_type        : <0xcf>
    <1263>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><1266>: Abbrev Number: 36 (DW_TAG_variable)
    <1267>   DW_AT_name        : (indirect string, offset: 0x6af3a): u16currentCoil
    <126b>   DW_AT_decl_file   : 1
    <126c>   DW_AT_decl_line   : 1567
    <126e>   DW_AT_decl_column : 14
    <126f>   DW_AT_type        : <0xec>
    <1273>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><1276>: Abbrev Number: 36 (DW_TAG_variable)
    <1277>   DW_AT_name        : (indirect string, offset: 0x4d259): u16coil
    <127b>   DW_AT_decl_file   : 1
    <127c>   DW_AT_decl_line   : 1567
    <127e>   DW_AT_decl_column : 30
    <127f>   DW_AT_type        : <0xec>
    <1283>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1286>: Abbrev Number: 36 (DW_TAG_variable)
    <1287>   DW_AT_name        : (indirect string, offset: 0x83930): u16StartCoil
    <128b>   DW_AT_decl_file   : 1
    <128c>   DW_AT_decl_line   : 1570
    <128e>   DW_AT_decl_column : 14
    <128f>   DW_AT_type        : <0xec>
    <1293>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <2><1296>: Abbrev Number: 36 (DW_TAG_variable)
